Ihara-Hideki/BZ5_RX66T/workspace/BZ5/src/common/compile/H/SfrRegister.h
//<><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><>
//<><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><>
//Å@ÅyÉwÉbÉ_ñºÅz
//Å@Å@Å@ÇrÇÜÇíÇqÇÖÇáÇâÇìÇîÇÖÇí
//Å@ÅyÉwÉbÉ_ÉåÉxÉãÅz
//Å@Å@Å@ÇkÇdÇuÇdÇkÅFÇgÅ|ÇP
//  ÅyÉwÉbÉ_ê‡ñæÅz
//      ì‡ïîÉåÉWÉXÉ^ÉAÉhÉåÉXíËã`
//  ÅyîıçlÅz
//      Ç»Çµ
//  ÅyçXêVóöóÅz
//      2006.07.06  H.Ihara
//
//            Copyright(C)2006 MATSUSHITA Welding Systems Co., Ltd. ALL RIGHT RESERVED
//
//<><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><>
//<><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><>
#ifndef	__SFR_REG_DEFINE
#define	__SFR_REG_DEFINE

#ifndef __M32170
	#ifndef __M32171
		#ifndef __M32186
			#define	__M32171	// É^Å[ÉQÉbÉgÇbÇoÇtÇÃíËã`Ç™çsÇÌÇÍÇƒÇ¢Ç»Ç¢èÍçáÇÕÅAÉ^Å[ÉQÉbÉgÇbÇoÇtÇÕÇlÇRÇQÇPÇVÇPÇ∆Ç∑ÇÈÅB
		#endif	// __M32186
	#endif	// __M32171
#endif	// __M32170


#define	IVECT			(*(ushort *)0x00800000)
#define	IMASK			(*(uchar *)0x00800004)
#define	SBICR			(*(uchar *)0x00800006)

#ifdef __M32186
	#define	IRAMWRCR		(*(uchar *)0x00800056)
	#define	ICAN1ERCR		(*(uchar *)0x00800057)
	#define	ICAN1SSCR		(*(uchar *)0x00800058)
	#define	ICAN1TRCR		(*(uchar *)0x00800059)
	#define	ICAN0ERCR		(*(uchar *)0x0080005A)
	#define	ICAN0SSCR		(*(uchar *)0x0080005B)
	#define	ICAN0TRCR		(*(uchar *)0x0080005C)
	#define	IDRIEVCR		(*(uchar *)0x0080005D)
	#define	IDRICNTCR		(*(uchar *)0x0080005E)
	#define	IDRITRCR		(*(uchar *)0x0080005F)
#endif	// __M32186

#define	ICAN0CR			(*(uchar *)0x00800060)

#ifndef __M32171
	#ifdef __M32170
		#define	ITML1CR			(*(uchar *)0x00800061)
		#define	ITID2CR			(*(uchar *)0x00800062)
		#define	IAD1CCR			(*(uchar *)0x00800063)
	#endif	// __M32170
	#define	ISIO45CR		(*(uchar *)0x00800064)
	#define	ITOM0CR			(*(uchar *)0x00800065)
	#define	ITID1CR			(*(uchar *)0x00800066)
#endif	// __M32170 or __M32186

#define	IRTDCR			(*(uchar *)0x00800067)
#define	ISIO23CR		(*(uchar *)0x00800068)
#define	IDMA59CR		(*(uchar *)0x00800069)

#ifndef __M32171
	#define	ITOD0CR			(*(uchar *)0x0080006A)
	#define	ITID0CR			(*(uchar *)0x0080006B)
#endif	// __M32170 or __M32186

#define	IAD0CCR			(*(uchar *)0x0080006C)
#define	ISIO0TXCR		(*(uchar *)0x0080006D)
#define	ISIO0RXCR		(*(uchar *)0x0080006E)
#define	ISIO1TXCR		(*(uchar *)0x0080006F)
#define	ISIO1RXCR		(*(uchar *)0x00800070)
#define	IDMA04CR		(*(uchar *)0x00800071)
#define	IMJTOCR0		(*(uchar *)0x00800072)
#define	IMJTOCR1		(*(uchar *)0x00800073)
#define	IMJTOCR2		(*(uchar *)0x00800074)
#define	IMJTOCR3		(*(uchar *)0x00800075)
#define	IMJTOCR4		(*(uchar *)0x00800076)
#define	IMJTOCR5		(*(uchar *)0x00800077)
#define	IMJTOCR6		(*(uchar *)0x00800078)
#define	IMJTOCR7		(*(uchar *)0x00800079)

#ifndef __M32171
	#define	IMJTICR0		(*(uchar *)0x0080007A)
#endif	// __M32170 or __M32186

#define	IMJTICR1		(*(uchar *)0x0080007B)
#define	IMJTICR2		(*(uchar *)0x0080007C)
#define	IMJTICR3		(*(uchar *)0x0080007D)
#define	IMJTICR4		(*(uchar *)0x0080007E)

#ifdef __M32186
	#define	ICAN1CR			(*(uchar *)0x0080007F)
#endif	// __M32186

#define	AD0SIM0			(*(uchar *)0x00800080)
#define	AD0SIM1			(*(uchar *)0x00800081)

#ifdef __M32186
	#define	AD0SIM2			(*(uchar *)0x00800083)
#endif	// __M32186

#define	AD0SCM0			(*(uchar *)0x00800084)
#define	AD0SCM1			(*(uchar *)0x00800085)

#ifdef __M32186
	#define	AD0DDACR		(*(uchar *)0x00800086)
	#define	AD0CVSCR		(*(uchar *)0x00800087)
#endif	// __M32186

#define	AD0SAR			(*(ushort *)0x00800088)

#ifdef __M32186
	#define	AD0DDASEL		(*(uchar *)0x0080008A)
#endif	// __M32186

#define	AD0CMP			(*(ushort *)0x0080008C)

#define	AD0DT0			(*(ushort *)0x00800090)
#define	AD0DT1			(*(ushort *)0x00800092)
#define	AD0DT2			(*(ushort *)0x00800094)
#define	AD0DT3			(*(ushort *)0x00800096)
#define	AD0DT4			(*(ushort *)0x00800098)
#define	AD0DT5			(*(ushort *)0x0080009A)
#define	AD0DT6			(*(ushort *)0x0080009C)
#define	AD0DT7			(*(ushort *)0x0080009E)
#define	AD0DT8			(*(ushort *)0x008000A0)
#define	AD0DT9			(*(ushort *)0x008000A2)
#define	AD0DT10			(*(ushort *)0x008000A4)
#define	AD0DT11			(*(ushort *)0x008000A6)
#define	AD0DT12			(*(ushort *)0x008000A8)
#define	AD0DT13			(*(ushort *)0x008000AA)
#define	AD0DT14			(*(ushort *)0x008000AC)
#define	AD0DT15			(*(ushort *)0x008000AE)

#define	AD08DT0			(*(ushort *)0x008000D1)
#define	AD08DT1			(*(ushort *)0x008000D3)
#define	AD08DT2			(*(ushort *)0x008000D5)
#define	AD08DT3			(*(ushort *)0x008000D7)
#define	AD08DT4			(*(ushort *)0x008000D9)
#define	AD08DT5			(*(ushort *)0x008000DB)
#define	AD08DT6			(*(ushort *)0x008000DD)
#define	AD08DT7			(*(ushort *)0x008000DF)
#define	AD08DT8			(*(ushort *)0x008000E1)
#define	AD08DT9			(*(ushort *)0x008000E3)
#define	AD08DT10		(*(ushort *)0x008000E5)
#define	AD08DT11		(*(ushort *)0x008000E7)
#define	AD08DT12		(*(ushort *)0x008000E9)
#define	AD08DT13		(*(ushort *)0x008000EB)
#define	AD08DT14		(*(ushort *)0x008000ED)
#define	AD08DT15		(*(ushort *)0x008000EF)

#define	SI23STAT		(*(uchar *)0x00800100)
#define	SI03MASK		(*(uchar *)0x00800101)
#define	SI03SEL			(*(uchar *)0x00800102)

#define	S0TCNT			(*(uchar *)0x00800110)
#define	S0MOD			(*(uchar *)0x00800111)
#define	S0TXB			(*(ushort *)0x00800112)
#define	S0RXB			(*(ushort *)0x00800114)
#define	S0RCNT			(*(uchar *)0x00800116)
#define	S0BAUR			(*(uchar *)0x00800117)

#ifdef __M32186
	#define	S0SMOD			(*(uchar *)0x00800118)
#endif	// __M32186

#define	S1TCNT			(*(uchar *)0x00800120)
#define	S1MOD			(*(uchar *)0x00800121)
#define	S1TXB			(*(ushort *)0x00800122)
#define	S1RXB			(*(ushort *)0x00800124)
#define	S1RCNT			(*(uchar *)0x00800126)
#define	S1BAUR			(*(uchar *)0x00800127)

#ifdef __M32186
	#define	S1SMOD			(*(uchar *)0x00800128)
#endif	// __M32186

#define	S2TCNT			(*(uchar *)0x00800130)
#define	S2MOD			(*(uchar *)0x00800131)
#define	S2TXB			(*(ushort *)0x00800132)
#define	S2RXB			(*(ushort *)0x00800134)
#define	S2RCNT			(*(uchar *)0x00800136)
#define	S2BAUR			(*(uchar *)0x00800137)

#ifdef __M32186
	#define	S2SMOD			(*(uchar *)0x00800138)
#endif	// __M32186

#ifndef __M32171
	#define	S3TCNT			(*(uchar *)0x00800140)
	#define	S3MOD			(*(uchar *)0x00800141)
	#define	S3TXB			(*(ushort *)0x00800142)
	#define	S3RXB			(*(ushort *)0x00800144)
	#define	S3RCNT			(*(uchar *)0x00800146)
	#define	S3BAUR			(*(uchar *)0x00800147)
	#define	S3SMOD			(*(uchar *)0x00800148)
#endif	// __M32170 or __M32186

