Ihara-Hideki/BZ5_RX66T/workspace/BZ5/src/common/compile/H/SfrRegister.h
#ifdef __M32186
	#define	CS0WTCR			(*(uchar *)0x00800180)
	#define	CS1WTCR			(*(uchar *)0x00800181)
	#define	CS2WTCR			(*(uchar *)0x00800182)
	#define	CS3WTCR			(*(uchar *)0x00800183)
#else
	#define	WTCCR			(*(uchar *)0x00800180)
#endif	// __M32186

#ifdef __M32186
	#define	CLKOUTSEL		(*(uchar *)0x008001A0)
	#define	FWAIT			(*(uchar *)0x008001A2)
#endif	// __M32186

#ifdef __M32186
	#define	FMOD			(*(uchar *)0x008001E0)
	#define	FSTAT			(*(uchar *)0x008001E1)
	#define	FCNT1			(*(uchar *)0x008001E2)
	#define	FCNT2			(*(uchar *)0x008001E3)
	#define	FCNT3			(*(uchar *)0x008001E4)
	#define	FCNT4			(*(uchar *)0x008001E5)
#endif	// __M32186

#ifdef __M32186
	#define	CNTCKSEL		(*(uchar *)0x00800200)
#endif	// __M32186

#define	CKIEBCR			(*(uchar *)0x00800201)
#define	PRS0			(*(uchar *)0x00800202)
#define	PRS1			(*(uchar *)0x00800203)
#define	PRS2			(*(uchar *)0x00800204)
#define	OEBCR			(*(uchar *)0x00800205)

#define	TCLKCR			(*(ushort *)0x00800210)
#define	TINCR0			(*(ushort *)0x00800212)
#ifndef __M32171
	#define	TINCR1			(*(ushort *)0x00800214)
	#define	TINCR2			(*(ushort *)0x00800216)
#endif	// __M32170 or __M32186
#define	TINCR3			(*(ushort *)0x00800218)
#define	TINCR4			(*(ushort *)0x0080021A)

#define	FFS0			(*(ushort *)0x00800220)
#define	FFS1			(*(uchar *)0x00800223)
#define	FFP0			(*(ushort *)0x00800224)
#define	FFD0			(*(ushort *)0x00800226)
#define	FFP1			(*(uchar *)0x00800229)
#define	FFD1			(*(uchar *)0x0080022B)

#define	TOPIR0			(*(uchar *)0x00800230)
#define	TOPIR1			(*(uchar *)0x00800231)
#define	TOPIR2			(*(uchar *)0x00800232)
#define	TOPIR3			(*(uchar *)0x00800233)
#define	TIOIR0			(*(uchar *)0x00800234)
#define	TIOIR1			(*(uchar *)0x00800235)
#define	TIOIR2			(*(uchar *)0x00800236)
#define	TMSIR			(*(uchar *)0x00800237)
#define	TINIR0			(*(uchar *)0x00800238)
#define	TINIR1			(*(uchar *)0x00800239)
#ifndef __M32171
	#define	TINIR2			(*(uchar *)0x0080023A)
	#define	TINIR3			(*(uchar *)0x0080023B)
#endif	// __M32170 or __M32186
#define	TINIR4			(*(uchar *)0x0080023C)
#define	TINIR5			(*(uchar *)0x0080023D)
#define	TINIR6			(*(uchar *)0x0080023E)
#ifndef __M32171
	#define	TINIR7			(*(uchar *)0x0080023F)
#endif	// __M32170 or __M32186
#define	TOP0CT			(*(ushort *)0x00800240)
#define	TOP0RL			(*(ushort *)0x00800242)
#define	TOP0CC			(*(ushort *)0x00800246)

#define	TOP1CT			(*(ushort *)0x00800250)
#define	TOP1RL			(*(ushort *)0x00800252)
#define	TOP1CC			(*(ushort *)0x00800256)

#define	TOP2CT			(*(ushort *)0x00800260)
#define	TOP2RL			(*(ushort *)0x00800262)
#define	TOP2CC			(*(ushort *)0x00800266)

#define	TOP3CT			(*(ushort *)0x00800270)
#define	TOP3RL			(*(ushort *)0x00800272)
#define	TOP3CC			(*(ushort *)0x00800276)

#define	TOP4CT			(*(ushort *)0x00800280)
#define	TOP4RL			(*(ushort *)0x00800282)
#define	TOP4CC			(*(ushort *)0x00800286)

#define	TOP5CT			(*(ushort *)0x00800290)
#define	TOP5RL			(*(ushort *)0x00800292)
#define	TOP5CC			(*(ushort *)0x00800296)

#define	TOP05CR0		(*(ushort *)0x0080029A)
#define	TOP05CR1		(*(uchar *)0x0080029D)

#define	TOP6CT			(*(ushort *)0x008002A0)
#define	TOP6RL			(*(ushort *)0x008002A2)
#define	TOP6CC			(*(ushort *)0x008002A6)

#define	TOP67CR			(*(ushort *)0x008002AA)

#define	TOP7CT			(*(ushort *)0x008002B0)
#define	TOP7RL			(*(ushort *)0x008002B2)
#define	TOP7CC			(*(ushort *)0x008002B6)

#define	TOP8CT			(*(ushort *)0x008002C0)
#define	TOP8RL			(*(ushort *)0x008002C2)
#define	TOP8CC			(*(ushort *)0x008002C6)

#define	TOP9CT			(*(ushort *)0x008002D0)
#define	TOP9RL			(*(ushort *)0x008002D2)
#define	TOP9CC			(*(ushort *)0x008002D6)

#define	TOP10CT			(*(ushort *)0x008002E0)
#define	TOP10RL			(*(ushort *)0x008002E2)
#define	TOP10CC			(*(ushort *)0x008002E6)

#define	TOP810CR		(*(ushort *)0x008002EA)

#define	TOPEEN			(*(ushort *)0x008002FA)
#define	TOPPRO			(*(ushort *)0x008002FC)
#define	TOPCEN			(*(ushort *)0x008002FE)
#define	TIO0CT			(*(ushort *)0x00800300)
#define	TIO0RL1			(*(ushort *)0x00800304)
#define	TIO0RL0			(*(ushort *)0x00800306)

#define	TIO1CT			(*(ushort *)0x00800310)
#define	TIO1RL1			(*(ushort *)0x00800314)
#define	TIO1RL0			(*(ushort *)0x00800316)

#define	TIO03CR0		(*(ushort *)0x0080031A)
#define	TIO03CR1		(*(uchar *)0x0080031D)

#define	TIO2CT			(*(ushort *)0x00800320)
#define	TIO2RL1			(*(ushort *)0x00800324)
#define	TIO2RL0			(*(ushort *)0x00800326)

#define	TIO3CT			(*(ushort *)0x00800330)
#define	TIO3RL1			(*(ushort *)0x00800334)
#define	TIO3RL0			(*(ushort *)0x00800336)

#define	TIO4CT			(*(ushort *)0x00800340)
#define	TIO4RL1			(*(ushort *)0x00800344)
#define	TIO4RL0			(*(ushort *)0x00800346)

#define	TIO4CR			(*(uchar *)0x0080034A)
#define	TIO5CR			(*(uchar *)0x0080034B)

#define	TIO5CT			(*(ushort *)0x00800350)
#define	TIO5RL1			(*(ushort *)0x00800354)
#define	TIO5RL0			(*(ushort *)0x00800356)

#define	TIO6CT			(*(ushort *)0x00800360)
#define	TIO6RL1			(*(ushort *)0x00800364)
#define	TIO6RL0			(*(ushort *)0x00800366)

#define	TIO6CR			(*(uchar *)0x0080036A)
#define	TIO7CR			(*(uchar *)0x0080036B)

#define	TIO7CT			(*(ushort *)0x00800370)
#define	TIO7RL1			(*(ushort *)0x00800374)
#define	TIO7RL0			(*(ushort *)0x00800376)

#define	TIO8CT			(*(ushort *)0x00800380)
#define	TIO8RL1			(*(ushort *)0x00800384)
#define	TIO8RL0			(*(ushort *)0x00800386)

#define	TIO8CR			(*(uchar *)0x0080038A)
#define	TIO9CR			(*(uchar *)0x0080038B)

#define	TIO9CT			(*(ushort *)0x00800390)
#define	TIO9RL1			(*(ushort *)0x00800394)
#define	TIO9RL0			(*(ushort *)0x00800396)

#define	TIOPRO			(*(ushort *)0x008003BC)
#define	TIOCEN			(*(ushort *)0x008003BE)
#define	TMS0CT			(*(ushort *)0x008003C0)
#define	TMS0MR3			(*(ushort *)0x008003C2)
#define	TMS0MR2			(*(ushort *)0x008003C4)
#define	TMS0MR1			(*(ushort *)0x008003C6)
#define	TMS0MR0			(*(ushort *)0x008003C8)

#define	TMS0CR			(*(uchar *)0x008003CA)
#define	TMS1CR			(*(uchar *)0x008003CB)

#define	TMS1CT			(*(ushort *)0x008003D0)
#define	TMS1MR3			(*(ushort *)0x008003D2)
#define	TMS1MR2			(*(ushort *)0x008003D4)
#define	TMS1MR1			(*(ushort *)0x008003D6)
#define	TMS1MR0			(*(ushort *)0x008003D8)

#define	TML0CT			(*(ulong *)0x008003E0)
#define	TML0CTH			(*(ushort *)0x008003E0)
#define	TML0CTL			(*(ushort *)0x008003E2)

#define	TML0CR			(*(uchar *)0x008003EB)

#define	TML0MR3			(*(ulong *)0x008003F0)
#define	TML0MR3H		(*(ushort *)0x008003F0)
#define	TML0MR3L		(*(ushort *)0x008003F2)
#define	TML0MR2			(*(ulong *)0x008003F4)
#define	TML0MR2H		(*(ushort *)0x008003F4)
#define	TML0MR2L		(*(ushort *)0x008003F6)
#define	TML0MR1			(*(ulong *)0x008003F8)
#define	TML0MR1H		(*(ushort *)0x008003F8)
#define	TML0MR1L		(*(ushort *)0x008003FA)
#define	TML0MR0			(*(ulong *)0x008003FC)
#define	TML0MR0H		(*(ushort *)0x008003FC)
#define	TML0MR0L		(*(ushort *)0x008003FE)

#define	DM04ITST		(*(uchar *)0x00800400)
#define	DM04ITMK		(*(uchar *)0x00800401)

#define	DM59ITST		(*(uchar *)0x00800408)
#define	DM59ITMK		(*(uchar *)0x00800409)

#define	DM0CNT			(*(uchar *)0x00800410)
#define	DM0TCT			(*(uchar *)0x00800411)
#define	DM0SA			(*(ushort *)0x00800412)
#define	DM0DA			(*(ushort *)0x00800414)

#define	DM5CNT			(*(uchar *)0x00800418)
#define	DM5TCT			(*(uchar *)0x00800419)
#define	DM5SA			(*(ushort *)0x0080041A)
#define	DM5DA			(*(ushort *)0x0080041C)

#define	DM1CNT			(*(uchar *)0x00800420)
#define	DM1TCT			(*(uchar *)0x00800421)
#define	DM1SA			(*(ushort *)0x00800422)
#define	DM1DA			(*(ushort *)0x00800424)

#define	DM6CNT			(*(uchar *)0x00800428)
#define	DM6TCT			(*(uchar *)0x00800429)
#define	DM6SA			(*(ushort *)0x0080042A)
#define	DM6DA			(*(ushort *)0x0080042C)

