Ihara-Hideki/BZ5_RX66T/workspace/BZ5/src/common/compile/H/SfrRegister.h
#define	DM2CNT			(*(uchar *)0x00800430)
#define	DM2TCT			(*(uchar *)0x00800431)
#define	DM2SA			(*(ushort *)0x00800432)
#define	DM2DA			(*(ushort *)0x00800434)

#define	DM7CNT			(*(uchar *)0x00800438)
#define	DM7TCT			(*(uchar *)0x00800439)
#define	DM7SA			(*(ushort *)0x0080043A)
#define	DM7DA			(*(ushort *)0x0080043C)

#define	DM3CNT			(*(uchar *)0x00800440)
#define	DM3TCT			(*(uchar *)0x00800441)
#define	DM3SA			(*(ushort *)0x00800442)
#define	DM3DA			(*(ushort *)0x00800444)

#define	DM8CNT			(*(uchar *)0x00800448)
#define	DM8TCT			(*(uchar *)0x00800449)
#define	DM8SA			(*(ushort *)0x0080044A)
#define	DM8DA			(*(ushort *)0x0080044C)

#define	DM4CNT			(*(uchar *)0x00800450)
#define	DM4TCT			(*(uchar *)0x00800451)
#define	DM4SA			(*(ushort *)0x00800452)
#define	DM4DA			(*(ushort *)0x00800454)

#define	DM9CNT			(*(uchar *)0x00800458)
#define	DM9TCT			(*(uchar *)0x00800459)
#define	DM9SA			(*(ushort *)0x0080045A)
#define	DM9DA			(*(ushort *)0x0080045C)

#define	DM0SRI			(*(ushort *)0x00800460)
#define	DM1SRI			(*(ushort *)0x00800462)
#define	DM2SRI			(*(ushort *)0x00800464)
#define	DM3SRI			(*(ushort *)0x00800466)
#define	DM4SRI			(*(ushort *)0x00800468)

#define	DM5SRI			(*(ushort *)0x00800470)
#define	DM6SRI			(*(ushort *)0x00800472)
#define	DM7SRI			(*(ushort *)0x00800474)
#define	DM8SRI			(*(ushort *)0x00800476)
#define	DM9SRI			(*(ushort *)0x00800478)

#ifdef __M32186
	#define	PG01LEV			(*(uchar *)0x00800500)
	#define	PG3LEV			(*(uchar *)0x00800501)
	#define	PG45LEV			(*(uchar *)0x00800502)
	#define	PG67LEV			(*(uchar *)0x00800503)
	#define	PG8LEV			(*(uchar *)0x00800504)

	#define	PG01DRV			(*(uchar *)0x00800508)
	#define	PG3DRV			(*(uchar *)0x00800509)
	#define	PG45DRV			(*(uchar *)0x0080050A)
	#define	PG67DRV			(*(uchar *)0x0080050B)
	#define	PG8DRV			(*(uchar *)0x0080050C)

	#define	P70DRV			(*(uchar *)0x0080050D)

	#define	NZCNSLCR		(*(ushort *)0x00800510)

	#define	PO0DISGACR		(*(uchar *)0x00800520)
	#define	PO0LVGACR		(*(uchar *)0x00800521)
	#define	PO1DISGACR		(*(uchar *)0x00800522)
	#define	PO1LVGACR		(*(uchar *)0x00800523)

	#define	PWMOFF0EN		(*(uchar *)0x00800526)
	#define	PWMOFF1EN		(*(uchar *)0x00800527)

	#define	CANBUSCR		(*(uchar *)0x0080052A)
	#define	DDSEL			(*(uchar *)0x0080052B)

	#define	RAMWRIST		(*(ushort *)0x00800530)
	#define	RAMWRFST		(*(ushort *)0x00800534)
	#define	RAMWRCNT		(*(ushort *)0x00800538)
	#define	RAMWRPROT		(*(uchar *)0x0080050D)
#endif	// __M32186

#define	P0DATA			(*(uchar *)0x00800700)
#define	P1DATA			(*(uchar *)0x00800701)
#define	P2DATA			(*(uchar *)0x00800702)
#define	P3DATA			(*(uchar *)0x00800703)
#define	P4DATA			(*(uchar *)0x00800704)
#define	P6DATA			(*(uchar *)0x00800706)
#define	P7DATA			(*(uchar *)0x00800707)
#define	P8DATA			(*(uchar *)0x00800708)
#define	P9DATA			(*(uchar *)0x00800709)
#define	P10DATA			(*(uchar *)0x0080070A)
#define	P11DATA			(*(uchar *)0x0080070B)
#define	P12DATA			(*(uchar *)0x0080070C)
#define	P13DATA			(*(uchar *)0x0080070D)

#ifdef __M32170
	#define	P14DATA			(*(uchar *)0x0080070E)
#endif	// __M32170

#define	P15DATA			(*(uchar *)0x0080070F)

#ifdef __M32170
	#define	P16DATA			(*(uchar *)0x00800710)
#endif	// __M32170

#define	P17DATA			(*(uchar *)0x00800711)

#ifdef __M32170
	#define	P18DATA			(*(uchar *)0x00800712)
	#define	P19DATA			(*(uchar *)0x00800713)
	#define	P20DATA			(*(uchar *)0x00800714)
	#define	P21DATA			(*(uchar *)0x00800715)
#endif	// __M32170

#define	P22DATA			(*(uchar *)0x00800716)

#define	P0DIR			(*(uchar *)0x00800720)
#define	P1DIR			(*(uchar *)0x00800721)
#define	P2DIR			(*(uchar *)0x00800722)
#define	P3DIR			(*(uchar *)0x00800723)
#define	P4DIR			(*(uchar *)0x00800724)
#define	P6DIR			(*(uchar *)0x00800726)
#define	P7DIR			(*(uchar *)0x00800727)
#define	P8DIR			(*(uchar *)0x00800728)
#define	P9DIR			(*(uchar *)0x00800729)
#define	P10DIR			(*(uchar *)0x0080072A)
#define	P11DIR			(*(uchar *)0x0080072B)
#define	P12DIR			(*(uchar *)0x0080072C)
#define	P13DIR			(*(uchar *)0x0080072D)

#ifdef __M32170
	#define	P14DIR			(*(uchar *)0x0080072E)
#endif	// __M32170

#define	P15DIR			(*(uchar *)0x0080072F)

#ifdef __M32170
	#define	P16DIR			(*(uchar *)0x00800730)
#endif	// __M32170

#define	P17DIR			(*(uchar *)0x00800731)

#ifdef __M32170
	#define	P18DIR			(*(uchar *)0x00800732)
	#define	P19DIR			(*(uchar *)0x00800733)
	#define	P20DIR			(*(uchar *)0x00800734)
	#define	P21DIR			(*(uchar *)0x00800735)
#endif	// __M32170

#define	P22DIR			(*(uchar *)0x00800736)

#ifdef __M32186
	#define	P0MOD			(*(uchar *)0x00800740)
	#define	P1MOD			(*(uchar *)0x00800741)
	#define	P2MOD			(*(uchar *)0x00800742)
	#define	P3MOD			(*(uchar *)0x00800743)
	#define	P4MOD			(*(uchar *)0x00800744)
	#define	PICNT			(*(uchar *)0x00800745)
#else
	#define	PIEN			(*(uchar *)0x00800745)
#endif	// __M32186

#ifdef __M32170
	#define	P6MOD			(*(uchar *)0x00800746)
#endif	// __M32170

#define	P7MOD			(*(uchar *)0x00800747)
#define	P8MOD			(*(uchar *)0x00800748)
#define	P9MOD			(*(uchar *)0x00800749)
#define	P10MOD			(*(uchar *)0x0080074A)
#define	P11MOD			(*(uchar *)0x0080074B)
#define	P12MOD			(*(uchar *)0x0080074C)
#define	P13MOD			(*(uchar *)0x0080074D)

#ifdef __M32170
	#define	P14MOD			(*(uchar *)0x0080074E)
#endif	// __M32170

#define	P15MOD			(*(uchar *)0x0080074F)

#ifdef __M32170
	#define	P16MOD			(*(uchar *)0x00800750)
#endif	// __M32170

#define	P17MOD			(*(uchar *)0x00800751)

#ifdef __M32170
	#define	P18MOD			(*(uchar *)0x00800752)
	#define	P19MOD			(*(uchar *)0x00800753)
	#define	P20MOD			(*(uchar *)0x00800754)
	#define	P21MOD			(*(uchar *)0x00800755)
#endif	// __M32170

#define	P22MOD			(*(uchar *)0x00800756)

#ifdef __M32186
	#define	P0SMOD			(*(uchar *)0x00800760)
	#define	P1SMOD			(*(uchar *)0x00800761)
	#define	P3SMOD			(*(uchar *)0x00800763)
	#define	P4SMOD			(*(uchar *)0x00800764)
	#define	P7SMOD			(*(uchar *)0x00800767)
	#define	P8SMOD			(*(uchar *)0x00800768)
	#define	P9SMOD			(*(uchar *)0x00800769)
	#define	P10SMOD			(*(uchar *)0x0080076A)
	#define	P11SMOD			(*(uchar *)0x0080076B)
	#define	P12SMOD			(*(uchar *)0x0080076C)
	#define	P13SMOD			(*(uchar *)0x0080076D)
	#define	P15SMOD			(*(uchar *)0x0080076F)
	#define	P17SMOD			(*(uchar *)0x00800771)
	#define	P22SMOD			(*(uchar *)0x00800776)
	#define	WRRDIS			(*(uchar *)0x0080077B)
#endif	// __M32186

#define	BUSMODC			(*(uchar *)0x0080077F)

