Ihara-Hideki/BZ5_RX66T/workspace/BZ5/src/common/compile/H/SfrRegister.h
#ifdef __M32186
	#define	PO0DISGBCR		(*(uchar *)0x00800780)
	#define	PO0LVGBCR		(*(uchar *)0x00800781)
	#define	PO1DISGBCR		(*(uchar *)0x00800782)
	#define	PO1LVGBCR		(*(uchar *)0x00800783)
	#define	CLKCR			(*(uchar *)0x00800786)

	#define	TID0CT			(*(ushort *)0x0080078C)
	#define	TID0RL			(*(ushort *)0x0080078E)

	#define	TOU00CTW		(*(ulong *)0x00800790)
	#define	TOU00CTH		(*(ulong *)0x00800790)
	#define	TOU00CT			(*(ulong *)0x00800792)
	#define	TOU00RLW		(*(ulong *)0x00800794)
	#define	TOU00RL1		(*(ulong *)0x00800794)
	#define	TOU00RL0		(*(ulong *)0x00800796)

	#define	TOU01CTW		(*(ulong *)0x00800790)
	#define	TOU01CTH		(*(ulong *)0x00800790)
	#define	TOU01CT			(*(ulong *)0x00800792)
	#define	TOU01RLW		(*(ulong *)0x00800794)
	#define	TOU01RL1		(*(ulong *)0x00800794)
	#define	TOU01RL0		(*(ulong *)0x00800796)

	#define	TOU02CTW		(*(ulong *)0x008007A0)
	#define	TOU02CTH		(*(ulong *)0x008007A0)
	#define	TOU02CT			(*(ulong *)0x008007A2)
	#define	TOU02RLW		(*(ulong *)0x008007A4)
	#define	TOU02RL1		(*(ulong *)0x008007A4)
	#define	TOU02RL0		(*(ulong *)0x008007A6)

	#define	TOU03CTW		(*(ulong *)0x008007A8)
	#define	TOU03CTH		(*(ulong *)0x008007A8)
	#define	TOU03CT			(*(ulong *)0x008007AA)
	#define	TOU03RLW		(*(ulong *)0x008007AC)
	#define	TOU03RL1		(*(ulong *)0x008007AC)
	#define	TOU03RL0		(*(ulong *)0x008007AE)

	#define	TOU04CTW		(*(ulong *)0x008007B0)
	#define	TOU04CTH		(*(ulong *)0x008007B0)
	#define	TOU04CT			(*(ulong *)0x008007B2)
	#define	TOU04RLW		(*(ulong *)0x008007B4)
	#define	TOU04RL1		(*(ulong *)0x008007B4)
	#define	TOU04RL0		(*(ulong *)0x008007B6)

	#define	TOU05CTW		(*(ulong *)0x008007B8)
	#define	TOU05CTH		(*(ulong *)0x008007B8)
	#define	TOU05CT			(*(ulong *)0x008007BA)
	#define	TOU05RLW		(*(ulong *)0x008007BC)
	#define	TOU05RL1		(*(ulong *)0x008007BC)
	#define	TOU05RL0		(*(ulong *)0x008007BE)

	#define	TOU06CTW		(*(ulong *)0x008007C0)
	#define	TOU06CTH		(*(ulong *)0x008007C0)
	#define	TOU06CT			(*(ulong *)0x008007C2)
	#define	TOU06RLW		(*(ulong *)0x008007C4)
	#define	TOU06RL1		(*(ulong *)0x008007C4)
	#define	TOU06RL0		(*(ulong *)0x008007C6)

	#define	TOU07CTW		(*(ulong *)0x008007C8)
	#define	TOU07CTH		(*(ulong *)0x008007C8)
	#define	TOU07CT			(*(ulong *)0x008007CA)
	#define	TOU07RLW		(*(ulong *)0x008007CC)
	#define	TOU07RL1		(*(ulong *)0x008007CC)
	#define	TOU07RL0		(*(ulong *)0x008007CE)

	#define	PRS3			(*(uchar *)0x008007D0)
	#define	TID0PRS3EN		(*(uchar *)0x008007D1)
	#define	TOD0IMA			(*(uchar *)0x008007D2)
	#define	TOD0IST			(*(uchar *)0x008007D3)
	#define	SHFFP2126P		(*(uchar *)0x008007D4)
	#define	FFP2128P		(*(uchar *)0x008007D5)
	#define	SHFFP2126D		(*(uchar *)0x008007D6)
	#define	FFP2128D		(*(uchar *)0x008007D7)
	#define	TOU0CR1			(*(ushort *)0x008007D8)
	#define	TOD0CR0			(*(ushort *)0x008007DA)
	#define	TOD0PRO			(*(uchar *)0x008007DD)
	#define	TOD0CEN			(*(uchar *)0x008007DF)

	#define	PWMOFF0CR		(*(uchar *)0x008007E0)
	#define	TIN2425CR		(*(uchar *)0x008007E1)
	#define	TIN2425IMA		(*(uchar *)0x008007E2)
	#define	TIN2425IST		(*(uchar *)0x008007E3)
#else	// __M32170 or __M32171
	#ifdef __M32170
		#define	TID0CT			(*(ushort *)0x0080078C)
		#define	TID0RL			(*(ushort *)0x0080078E)

		#define	TOD00CT			(*(ushort *)0x00800790)
		#define	TOD00RL1		(*(ushort *)0x00800794)
		#define	TOD00RL0		(*(ushort *)0x00800796)

		#define	TOD01CT			(*(ushort *)0x00800798)
		#define	TOD01RL1		(*(ushort *)0x0080079C)
		#define	TOD01RL0		(*(ushort *)0x0080079E)

		#define	TOD02CT			(*(ushort *)0x008007A0)
		#define	TOD02RL1		(*(ushort *)0x008007A4)
		#define	TOD02RL0		(*(ushort *)0x008007A6)

		#define	TOD03CT			(*(ushort *)0x008007A8)
		#define	TOD03RL1		(*(ushort *)0x008007AC)
		#define	TOD03RL0		(*(ushort *)0x008007AE)

		#define	TOD04CT			(*(ushort *)0x008007B0)
		#define	TOD04RL1		(*(ushort *)0x008007B4)
		#define	TOD04RL0		(*(ushort *)0x008007B6)

		#define	TOD05CT			(*(ushort *)0x008007B8)
		#define	TOD05RL1		(*(ushort *)0x008007BC)
		#define	TOD05RL0		(*(ushort *)0x008007BE)

		#define	TOD06CT			(*(ushort *)0x008007C0)
		#define	TOD06RL1		(*(ushort *)0x008007C4)
		#define	TOD06RL0		(*(ushort *)0x008007C6)

		#define	TOD07CT			(*(ushort *)0x008007C8)
		#define	TOD07RL1		(*(ushort *)0x008007CC)
		#define	TOD07RL0		(*(ushort *)0x008007CE)

		#define	PRS3			(*(uchar *)0x008007D0)
		#define	TID0PRS3EN		(*(uchar *)0x008007D1)
		#define	TOD0IMA			(*(uchar *)0x008007D2)
		#define	TOD0IST			(*(uchar *)0x008007D3)
		#define	FFP2			(*(uchar *)0x008007D5)
		#define	FFD2			(*(uchar *)0x008007D7)

		#define	TOD0CR			(*(ushort *)0x008007DA)
		#define	TOD0PRO			(*(uchar *)0x008007DD)
		#define	TOD0CEN			(*(uchar *)0x008007DF)
	#endif	// __M32170
	#define	FMOD			(*(uchar *)0x008007E0)
	#define	FSTAT1			(*(uchar *)0x008007E1)
	#define	FCNT1			(*(uchar *)0x008007E2)
	#define	FCNT2			(*(uchar *)0x008007E3)
	#define	FCNT3			(*(uchar *)0x008007E4)
	#define	FCNT4			(*(uchar *)0x008007E5)
#endif	// __M32186

#define	FELBANK0		(*(ushort *)0x008007E8)

#ifdef __M32186
	#define	FELBANK1		(*(ushort *)0x008007EA)
	#define	FELBANK2		(*(ushort *)0x008007EC)
	#define	FELBANK3		(*(ushort *)0x008007EE)
	#define	FELBANK4		(*(ushort *)0x008007F0)
	#define	FELBANK5		(*(ushort *)0x008007F2)
	#define	FELBANK6		(*(ushort *)0x008007F4)
	#define	FELBANK7		(*(ushort *)0x008007F6)
#else // __M32170 or __M32171
	#ifdef __M32170
		#define	FELBANK1		(*(ushort *)0x008007EA)
		#define	FELBANK2		(*(ushort *)0x008007EC)
		#define	FELBANK3		(*(ushort *)0x008007EE)
	#endif	// __M32170
	#define	FESBANK0		(*(ushort *)0x008007F0)
	#define	FESBANK1		(*(ushort *)0x008007F2)
#endif	// __M32186

#ifndef __M32171
	#define	SI45STAT		(*(uchar *)0x00800A00)
	#define	SI45MASK		(*(uchar *)0x00800A01)
	#define	SI45SEL			(*(uchar *)0x00800A02)

	#define	S4TCNT			(*(uchar *)0x00800A10)
	#define	S4MOD			(*(uchar *)0x00800A11)
	#define	S4TXB			(*(ushort *)0x00800A12)
	#define	S4RXB			(*(ushort *)0x00800A14)
	#define	S4RCNT			(*(uchar *)0x00800A16)
	#define	S4BAUR			(*(uchar *)0x00800A17)
	#ifdef __M32186
		#define	S4SMOD			(*(uchar *)0x00800A18)
	#endif	// __M32186
	#define	S5TCNT			(*(uchar *)0x00800A20)
	#define	S5MOD			(*(uchar *)0x00800A21)
	#define	S5TXB			(*(ushort *)0x00800A22)
	#define	S5RXB			(*(ushort *)0x00800A24)
	#define	S5RCNT			(*(uchar *)0x00800A26)
	#define	S5BAUR			(*(uchar *)0x00800A27)
	#ifdef __M32186
		#define	S5SMOD			(*(uchar *)0x00800A28)
	#endif	// __M32186

	#ifdef __M32170
		#define	AD1SIM0			(*(uchar *)0x00800A80)
		#define	AD1SIM1			(*(uchar *)0x00800A81)

		#define	AD1SCM0			(*(uchar *)0x00800A84)
		#define	AD1SCM1			(*(uchar *)0x00800A85)

		#define	AD1SAR			(*(ushort *)0x00800A88)

		#define	AD1CMP			(*(ushort *)0x00800A8C)

		#define	AD1DT0			(*(ushort *)0x00800A90)
		#define	AD1DT1			(*(ushort *)0x00800A92)
		#define	AD1DT2			(*(ushort *)0x00800A94)
		#define	AD1DT3			(*(ushort *)0x00800A96)
		#define	AD1DT4			(*(ushort *)0x00800A98)
		#define	AD1DT5			(*(ushort *)0x00800A9A)
		#define	AD1DT6			(*(ushort *)0x00800A9C)
		#define	AD1DT7			(*(ushort *)0x00800A9E)
		#define	AD1DT8			(*(ushort *)0x00800AA0)
		#define	AD1DT9			(*(ushort *)0x00800AA2)
		#define	AD1DT10			(*(ushort *)0x00800AA4)
		#define	AD1DT11			(*(ushort *)0x00800AA6)
		#define	AD1DT12			(*(ushort *)0x00800AA8)
		#define	AD1DT13			(*(ushort *)0x00800AAA)
		#define	AD1DT14			(*(ushort *)0x00800AAC)
		#define	AD1DT15			(*(ushort *)0x00800AAE)

