Ihara-Hideki/BZ5_RX66T/workspace/BZ5/src/common/compile/H/SfrRegister.h
		#define	AD18DT0			(*(uchar *)0x00800AD0)
		#define	AD18DT1			(*(uchar *)0x00800AD2)
		#define	AD18DT2			(*(uchar *)0x00800AD4)
		#define	AD18DT3			(*(uchar *)0x00800AD6)
		#define	AD18DT4			(*(uchar *)0x00800AD8)
		#define	AD18DT5			(*(uchar *)0x00800ADA)
		#define	AD18DT6			(*(uchar *)0x00800ADC)
		#define	AD18DT7			(*(uchar *)0x00800ADE)
		#define	AD18DT8			(*(uchar *)0x00800AD0)
		#define	AD18DT9			(*(uchar *)0x00800AE2)
		#define	AD18DT10		(*(uchar *)0x00800AE4)
		#define	AD18DT11		(*(uchar *)0x00800AE6)
		#define	AD18DT12		(*(uchar *)0x00800AE8)
		#define	AD18DT13		(*(uchar *)0x00800AEA)
		#define	AD18DT14		(*(uchar *)0x00800AEC)
		#define	AD18DT15		(*(uchar *)0x00800AEE)
	#endif	// __M32170

	#define	TID1CT			(*(ushort *)0x00800B8C)
	#define	TID1RL			(*(ushort *)0x00800B8E)

	#ifdef __M32170
		#define	TOD10CT			(*(ushort *)0x00800B90)
		#define	TOD10RL1		(*(ushort *)0x00800B94)
		#define	TOD10RL0		(*(ushort *)0x00800B96)

		#define	TOD11CT			(*(ushort *)0x00800B98)
		#define	TOD11RL1		(*(ushort *)0x00800B9C)
		#define	TOD11RL0		(*(ushort *)0x00800B9E)

		#define	TOD12CT			(*(ushort *)0x00800BA0)
		#define	TOD12RL1		(*(ushort *)0x00800BA4)
		#define	TOD12RL0		(*(ushort *)0x00800BA6)

		#define	TOD13CT			(*(ushort *)0x00800BA8)
		#define	TOD13RL1		(*(ushort *)0x00800BAC)
		#define	TOD13RL0		(*(ushort *)0x00800BAE)

		#define	TOD14CT			(*(ushort *)0x00800BB0)
		#define	TOD14RL1		(*(ushort *)0x00800BB4)
		#define	TOD14RL0		(*(ushort *)0x00800BB6)

		#define	TOD15CT			(*(ushort *)0x00800BB8)
		#define	TOD15RL1		(*(ushort *)0x00800BBC)
		#define	TOD15RL0		(*(ushort *)0x00800BBE)

		#define	TOD16CT			(*(ushort *)0x00800BC0)
		#define	TOD16RL1		(*(ushort *)0x00800BC4)
		#define	TOD16RL0		(*(ushort *)0x00800BC6)

		#define	TOD17CT			(*(ushort *)0x00800BC8)
		#define	TOD17RL1		(*(ushort *)0x00800BCC)
		#define	TOD17RL0		(*(ushort *)0x00800BCE)

		#define	PRS4			(*(uchar *)0x00800BD0)
		#define	TID1PRS4EN		(*(uchar *)0x00800BD1)
		#define	TOD1IMA			(*(uchar *)0x00800BD2)
		#define	TOD1IST			(*(uchar *)0x00800BD3)
		#define	FFP3			(*(uchar *)0x00800BD5)
		#define	FFD3			(*(uchar *)0x00800BD7)

		#define	TOD1CR			(*(ushort *)0x00800BDA)

		#define	TOD1PRO			(*(uchar *)0x00800BDD)
		#define	TOD1CEN			(*(uchar *)0x00800BDF)

		#define	TID2CT			(*(ushort *)0x00800C8C)
		#define	TID2RL			(*(ushort *)0x00800C8E)

		#define	TOM00CT			(*(ushort *)0x00800C90)
		#define	TOM00RL1		(*(ushort *)0x00800C94)
		#define	TOM00RL0		(*(ushort *)0x00800C96)

		#define	TOM01CT			(*(ushort *)0x00800C98)
		#define	TOM01RL1		(*(ushort *)0x00800C9C)
		#define	TOM01RL0		(*(ushort *)0x00800C9E)

		#define	TOM02CT			(*(ushort *)0x00800CA0)
		#define	TOM02RL1		(*(ushort *)0x00800CA4)
		#define	TOM02RL0		(*(ushort *)0x00800CA6)

		#define	TOM03CT			(*(ushort *)0x00800CA8)
		#define	TOM03RL1		(*(ushort *)0x00800CAC)
		#define	TOM03RL0		(*(ushort *)0x00800CAE)

		#define	TOM04CT			(*(ushort *)0x00800CB0)
		#define	TOM04RL1		(*(ushort *)0x00800CB4)
		#define	TOM04RL0		(*(ushort *)0x00800CB6)

		#define	TOM05CT			(*(ushort *)0x00800CB8)
		#define	TOM05RL1		(*(ushort *)0x00800CBC)
		#define	TOM05RL0		(*(ushort *)0x00800CBE)

		#define	TOM06CT			(*(ushort *)0x00800CC0)
		#define	TOM06RL1		(*(ushort *)0x00800CC4)
		#define	TOM06RL0		(*(ushort *)0x00800CC6)

		#define	TOM07CT			(*(ushort *)0x00800CC8)
		#define	TOM07RL1		(*(ushort *)0x00800CCC)
		#define	TOM07RL0		(*(ushort *)0x00800CCE)

		#define	PRS5			(*(uchar *)0x00800CD0)
		#define	TID2PRS5EN		(*(uchar *)0x00800CD1)
		#define	TOM0IMA			(*(uchar *)0x00800CD2)
		#define	TOM0IST			(*(uchar *)0x00800CD3)
		#define	FFP4			(*(uchar *)0x00800CD5)
		#define	FFD4			(*(uchar *)0x00800CD7)

		#define	TOM0CR			(*(ushort *)0x00800CDA)
		#define	TOM0PRO			(*(uchar *)0x00800CD5)
		#define	TOM0CEN			(*(uchar *)0x00800CD7)
	#else	// __M32186
		#define	TOU10CTW		(*(ulong *)0x00800B90)
		#define	TOU10CTH		(*(ushort *)0x00800B90)
		#define	TOU10CT			(*(ushort *)0x00800B92)
		#define	TOU10RLW		(*(ulong *)0x00800B94)
		#define	TOU10RL1		(*(ushort *)0x00800B94)
		#define	TOU10RL0		(*(ushort *)0x00800B96)

		#define	TOU11CTW		(*(ulong *)0x00800B98)
		#define	TOU11CTH		(*(ushort *)0x00800B98)
		#define	TOU11CT			(*(ushort *)0x00800B9A)
		#define	TOU11RLW		(*(ulong *)0x00800B9C)
		#define	TOU11RL1		(*(ushort *)0x00800B9C)
		#define	TOU11RL0		(*(ushort *)0x00800B9E)

		#define	TOU12CTW		(*(ulong *)0x00800BA0)
		#define	TOU12CTH		(*(ushort *)0x00800BA0)
		#define	TOU12CT			(*(ushort *)0x00800BA2)
		#define	TOU12RLW		(*(ulong *)0x00800BA4)
		#define	TOU12RL1		(*(ushort *)0x00800BA4)
		#define	TOU12RL0		(*(ushort *)0x00800BA6)

		#define	TOU13CTW		(*(ulong *)0x00800BA8)
		#define	TOU13CTH		(*(ushort *)0x00800BA8)
		#define	TOU13CT			(*(ushort *)0x00800BAA)
		#define	TOU13RLW		(*(ulong *)0x00800BAC)
		#define	TOU13RL1		(*(ushort *)0x00800BAC)
		#define	TOU13RL0		(*(ushort *)0x00800BAE)

		#define	TOU14CTW		(*(ulong *)0x00800BB0)
		#define	TOU14CTH		(*(ushort *)0x00800BB0)
		#define	TOU14CT			(*(ushort *)0x00800BB2)
		#define	TOU14RLW		(*(ulong *)0x00800BB4)
		#define	TOU14RL1		(*(ushort *)0x00800BB4)
		#define	TOU14RL0		(*(ushort *)0x00800BB6)

		#define	TOU15CTW		(*(ulong *)0x00800BB8)
		#define	TOU15CTH		(*(ushort *)0x00800BB8)
		#define	TOU15CT			(*(ushort *)0x00800BBA)
		#define	TOU15RLW		(*(ulong *)0x00800BBC)
		#define	TOU15RL1		(*(ushort *)0x00800BBC)
		#define	TOU15RL0		(*(ushort *)0x00800BBE)

		#define	TOU16CTW		(*(ulong *)0x00800BC0)
		#define	TOU16CTH		(*(ushort *)0x00800BC0)
		#define	TOU16CT			(*(ushort *)0x00800BC2)
		#define	TOU16RLW		(*(ulong *)0x00800BC4)
		#define	TOU16RL1		(*(ushort *)0x00800BC4)
		#define	TOU16RL0		(*(ushort *)0x00800BC6)

		#define	TOU17CTW		(*(ulong *)0x00800BC8)
		#define	TOU17CTH		(*(ushort *)0x00800BC8)
		#define	TOU17CT			(*(ushort *)0x00800BCA)
		#define	TOU17RLW		(*(ulong *)0x00800BCC)
		#define	TOU17RL1		(*(ushort *)0x00800BCC)
		#define	TOU17RL0		(*(ushort *)0x00800BCE)

		#define	PRS4			(*(uchar *)0x00800BD0)
		#define	TID1PRS4EN		(*(uchar *)0x00800BD1)
		#define	TOU1IMA			(*(uchar *)0x00800BD2)
		#define	TOU1IST			(*(uchar *)0x00800BD3)
		#define	SHFF2934P		(*(uchar *)0x00800BD4)
		#define	FF2936P			(*(uchar *)0x00800BD5)
		#define	SHFF2934D		(*(uchar *)0x00800BD6)
		#define	FF2936D			(*(uchar *)0x00800BD7)

		#define	TOU1CR1			(*(ushort *)0x00800BDA)
		#define	TOU1CR0			(*(ushort *)0x00800BDB)

		#define	TOU1PRO			(*(uchar *)0x00800BDD)
		#define	TOU1CEN			(*(uchar *)0x00800BDF)

		#define	PWMOFF1CR		(*(uchar *)0x00800BE0)
		#define	TIN2627CR		(*(uchar *)0x00800BE1)
		#define	TIN2627IMA		(*(uchar *)0x00800BE2)
		#define	TIN2627IST		(*(uchar *)0x00800BE3)
	#endif	// __M32170
#endif	// __M32170 or __M32186

#define	TML1CT			(*(ulong *)0x00800FE0)
#define	TML1CTH			(*(ushort *)0x00800FE0)
#define	TML1CTL			(*(ushort *)0x00800FE2)

#define	TML1CR			(*(uchar *)0x00800FEB)

