Ihara-Hideki/BZ5_RX66T/workspace/BZ5/src/common/compile/H/SfrRegister.h
#define	TML1MR3			(*(ulong *)0x00800FF0)
#define	TML1MR3H		(*(ushort *)0x00800FF0)
#define	TML1MR3L		(*(ushort *)0x00800FF2)
#define	TML1MR2			(*(ulong *)0x00800FF4)
#define	TML1MR2H		(*(ushort *)0x00800FF4)
#define	TML1MR2L		(*(ushort *)0x00800FF6)
#define	TML1MR1			(*(ulong *)0x00800FF8)
#define	TML1MR1H		(*(ushort *)0x00800FF8)
#define	TML1MR1L		(*(ushort *)0x00800FFA)
#define	TML1MR0			(*(ulong *)0x00800FFC)
#define	TML1MR0H		(*(ushort *)0x00800FFC)
#define	TML1MR0L		(*(ushort *)0x00800FFE)

#define	CAN0CNT			(*(ushort *)0x00801000)
#define	CAN0STAT		(*(ushort *)0x00801002)
#define	CAN0EXTID		(*(ushort *)0x00801004)
#define	CAN0CONF		(*(ushort *)0x00801006)
#define	CAN0TSTMP		(*(ushort *)0x00801008)
#define	CAN0REC			(*(uchar *)0x0080100A)
#define	CAN0TEC			(*(uchar *)0x0080100B)
#ifdef __M32186
	#define	CAN0SLISTW		(*(ulong *)0x0080100C)
	#define	CAN0SLIST		(*(ushort *)0x0080100C)
	#define	CAN0SLISTL		(*(ushort *)0x0080100E)
	#define	CAN0SLIMKW		(*(ulong *)0x00801010)
	#define	CAN0SLIMK		(*(ushort *)0x00801010)
	#define	CAN0SLIMKL		(*(ushort *)0x00801012)
#else
	#define	CAN0SLIST		(*(ushort *)0x0080100C)
	#define	CAN0SLIMK		(*(ushort *)0x00801010)
#endif	// __M32186

#define	CAN0ERIST		(*(uchar *)0x00801014)
#define	CAN0ERIMK		(*(uchar *)0x00801015)
#define	CAN0BRP			(*(uchar *)0x00801016)

#ifdef __M32186
	#define	CAN0MOD			(*(uchar *)0x00801018)
	#define	CAN0DMARQ		(*(uchar *)0x00801019)
	#define	CAN0MSN			(*(uchar *)0x0080101A)
	#define	CAN0CKSEL		(*(uchar *)0x0080101B)

	#define	CAN0FFSW		(*(ulong *)0x0080101C)
	#define	CAN0FFS			(*(ushort *)0x0080101C)
	#define	CAN0FFSL		(*(ushort *)0x0080101E)

	#define	C0GMSKAS0		(*(uchar *)0x00801020)
	#define	C0GMSKAS1		(*(uchar *)0x00801021)
	#define	C0GMSKAE0		(*(uchar *)0x00801022)
	#define	C0GMSKAE1		(*(uchar *)0x00801023)
	#define	C0GMSKAE2		(*(uchar *)0x00801024)

	#define	C0GMSKBS0		(*(uchar *)0x00801028)
	#define	C0GMSKBS1		(*(uchar *)0x00801029)
	#define	C0GMSKBE0		(*(uchar *)0x0080102A)
	#define	C0GMSKBE1		(*(uchar *)0x0080102B)
	#define	C0GMSKBE2		(*(uchar *)0x0080102C)
#else
	#define	C0GMSKS0		(*(uchar *)0x00801028)
	#define	C0GMSKS1		(*(uchar *)0x00801029)
	#define	C0GMSKE0		(*(uchar *)0x0080102A)
	#define	C0GMSKE1		(*(uchar *)0x0080102B)
	#define	C0GMSKE2		(*(uchar *)0x0080102C)
#endif	// __M32186

#define	C0LMSKAS0		(*(uchar *)0x00801030)
#define	C0LMSKAS1		(*(uchar *)0x00801031)
#define	C0LMSKAE0		(*(uchar *)0x00801032)
#define	C0LMSKAE1		(*(uchar *)0x00801033)
#define	C0LMSKAE2		(*(uchar *)0x00801034)

#define	C0LMSKBS0		(*(uchar *)0x00801038)
#define	C0LMSKBS1		(*(uchar *)0x00801039)
#define	C0LMSKBE0		(*(uchar *)0x0080103A)
#define	C0LMSKBE1		(*(uchar *)0x0080103B)
#define	C0LMSKBE2		(*(uchar *)0x0080103C)

#ifdef __M32186
	#define	CAN0SSMODEW		(*(ulong *)0x00801040)
	#define	CAN0SSMODE		(*(ushort *)0x00801040)
	#define	CAN0SSMODEL		(*(ushort *)0x00801042)

	#define	CAN0SSISTW		(*(ulong *)0x00801044)
	#define	CAN0SSIST		(*(ushort *)0x00801044)
	#define	CAN0SSISTL		(*(ushort *)0x00801046)

	#define	CAN0SSIMKW		(*(ulong *)0x00801048)
	#define	CAN0SSIMK		(*(ushort *)0x00801048)
	#define	CAN0SSIMKL		(*(ushort *)0x0080104A)
#endif	// __M32186

#define	C0MSL0CNT		(*(uchar *)0x00801050)
#define	C0MSL1CNT		(*(uchar *)0x00801051)
#define	C0MSL2CNT		(*(uchar *)0x00801052)
#define	C0MSL3CNT		(*(uchar *)0x00801053)
#define	C0MSL4CNT		(*(uchar *)0x00801054)
#define	C0MSL5CNT		(*(uchar *)0x00801055)
#define	C0MSL6CNT		(*(uchar *)0x00801056)
#define	C0MSL7CNT		(*(uchar *)0x00801057)
#define	C0MSL8CNT		(*(uchar *)0x00801058)
#define	C0MSL9CNT		(*(uchar *)0x00801059)
#define	C0MSL10CNT		(*(uchar *)0x0080105A)
#define	C0MSL11CNT		(*(uchar *)0x0080105B)
#define	C0MSL12CNT		(*(uchar *)0x0080105C)
#define	C0MSL13CNT		(*(uchar *)0x0080105D)
#define	C0MSL14CNT		(*(uchar *)0x0080105E)
#define	C0MSL15CNT		(*(uchar *)0x0080105F)
#ifdef __M32186
	#define	C0MSL16CNT		(*(uchar *)0x00801060)
	#define	C0MSL17CNT		(*(uchar *)0x00801061)
	#define	C0MSL18CNT		(*(uchar *)0x00801062)
	#define	C0MSL19CNT		(*(uchar *)0x00801063)
	#define	C0MSL20CNT		(*(uchar *)0x00801064)
	#define	C0MSL21CNT		(*(uchar *)0x00801065)
	#define	C0MSL22CNT		(*(uchar *)0x00801066)
	#define	C0MSL23CNT		(*(uchar *)0x00801067)
	#define	C0MSL24CNT		(*(uchar *)0x00801068)
	#define	C0MSL25CNT		(*(uchar *)0x00801069)
	#define	C0MSL26CNT		(*(uchar *)0x0080106A)
	#define	C0MSL27CNT		(*(uchar *)0x0080106B)
	#define	C0MSL28CNT		(*(uchar *)0x0080106C)
	#define	C0MSL29CNT		(*(uchar *)0x0080106D)
	#define	C0MSL30CNT		(*(uchar *)0x0080106E)
	#define	C0MSL31CNT		(*(uchar *)0x0080106F)
#endif	// __M32186

#define	C0MSL0SID0		(*(uchar *)0x00801100)
#define	C0MSL0SID1		(*(uchar *)0x00801101)
#define	C0MSL0EID0		(*(uchar *)0x00801102)
#define	C0MSL0EID1		(*(uchar *)0x00801103)
#define	C0MSL0EID2		(*(uchar *)0x00801104)
#define	C0MSL0DLC		(*(uchar *)0x00801105)
#define	C0MSL0DT0		(*(uchar *)0x00801106)
#define	C0MSL0DT1		(*(uchar *)0x00801107)
#define	C0MSL0DT2		(*(uchar *)0x00801108)
#define	C0MSL0DT3		(*(uchar *)0x00801109)
#define	C0MSL0DT4		(*(uchar *)0x0080110A)
#define	C0MSL0DT5		(*(uchar *)0x0080110B)
#define	C0MSL0DT6		(*(uchar *)0x0080110C)
#define	C0MSL0DT7		(*(uchar *)0x0080110D)
#define	C0MSL0TSP		(*(ushort *)0x0080110E)

#define	C0MSL1SID0		(*(uchar *)0x00801110)
#define	C0MSL1SID1		(*(uchar *)0x00801111)
#define	C0MSL1EID0		(*(uchar *)0x00801112)
#define	C0MSL1EID1		(*(uchar *)0x00801113)
#define	C0MSL1EID2		(*(uchar *)0x00801114)
#define	C0MSL1DLC		(*(uchar *)0x00801115)
#define	C0MSL1DT0		(*(uchar *)0x00801116)
#define	C0MSL1DT1		(*(uchar *)0x00801117)
#define	C0MSL1DT2		(*(uchar *)0x00801118)
#define	C0MSL1DT3		(*(uchar *)0x00801119)
#define	C0MSL1DT4		(*(uchar *)0x0080111A)
#define	C0MSL1DT5		(*(uchar *)0x0080111B)
#define	C0MSL1DT6		(*(uchar *)0x0080111C)
#define	C0MSL1DT7		(*(uchar *)0x0080111D)
#define	C0MSL1TSP		(*(ushort *)0x0080111E)

#define	C0MSL2SID0		(*(uchar *)0x00801120)
#define	C0MSL2SID1		(*(uchar *)0x00801121)
#define	C0MSL2EID0		(*(uchar *)0x00801122)
#define	C0MSL2EID1		(*(uchar *)0x00801123)
#define	C0MSL2EID2		(*(uchar *)0x00801124)
#define	C0MSL2DLC		(*(uchar *)0x00801125)
#define	C0MSL2DT0		(*(uchar *)0x00801126)
#define	C0MSL2DT1		(*(uchar *)0x00801127)
#define	C0MSL2DT2		(*(uchar *)0x00801128)
#define	C0MSL2DT3		(*(uchar *)0x00801129)
#define	C0MSL2DT4		(*(uchar *)0x0080112A)
#define	C0MSL2DT5		(*(uchar *)0x0080112B)
#define	C0MSL2DT6		(*(uchar *)0x0080112C)
#define	C0MSL2DT7		(*(uchar *)0x0080112D)
#define	C0MSL2TSP		(*(ushort *)0x0080112E)

