Ihara-Hideki/BZ5_RX66T/workspace/BZ5/src/common/compile/H/SfrRegister.h
#define	C0MSL3SID0		(*(uchar *)0x00801130)
#define	C0MSL3SID1		(*(uchar *)0x00801131)
#define	C0MSL3EID0		(*(uchar *)0x00801132)
#define	C0MSL3EID1		(*(uchar *)0x00801133)
#define	C0MSL3EID2		(*(uchar *)0x00801134)
#define	C0MSL3DLC		(*(uchar *)0x00801135)
#define	C0MSL3DT0		(*(uchar *)0x00801136)
#define	C0MSL3DT1		(*(uchar *)0x00801137)
#define	C0MSL3DT2		(*(uchar *)0x00801138)
#define	C0MSL3DT3		(*(uchar *)0x00801139)
#define	C0MSL3DT4		(*(uchar *)0x0080113A)
#define	C0MSL3DT5		(*(uchar *)0x0080113B)
#define	C0MSL3DT6		(*(uchar *)0x0080113C)
#define	C0MSL3DT7		(*(uchar *)0x0080113D)
#define	C0MSL3TSP		(*(ushort *)0x0080113E)

#define	C0MSL4SID0		(*(uchar *)0x00801140)
#define	C0MSL4SID1		(*(uchar *)0x00801141)
#define	C0MSL4EID0		(*(uchar *)0x00801142)
#define	C0MSL4EID1		(*(uchar *)0x00801143)
#define	C0MSL4EID2		(*(uchar *)0x00801144)
#define	C0MSL4DLC		(*(uchar *)0x00801145)
#define	C0MSL4DT0		(*(uchar *)0x00801146)
#define	C0MSL4DT1		(*(uchar *)0x00801147)
#define	C0MSL4DT2		(*(uchar *)0x00801148)
#define	C0MSL4DT3		(*(uchar *)0x00801149)
#define	C0MSL4DT4		(*(uchar *)0x0080114A)
#define	C0MSL4DT5		(*(uchar *)0x0080114B)
#define	C0MSL4DT6		(*(uchar *)0x0080114C)
#define	C0MSL4DT7		(*(uchar *)0x0080114D)
#define	C0MSL4TSP		(*(ushort *)0x0080114E)

#define	C0MSL5SID0		(*(uchar *)0x00801150)
#define	C0MSL5SID1		(*(uchar *)0x00801151)
#define	C0MSL5EID0		(*(uchar *)0x00801152)
#define	C0MSL5EID1		(*(uchar *)0x00801153)
#define	C0MSL5EID2		(*(uchar *)0x00801154)
#define	C0MSL5DLC		(*(uchar *)0x00801155)
#define	C0MSL5DT0		(*(uchar *)0x00801156)
#define	C0MSL5DT1		(*(uchar *)0x00801157)
#define	C0MSL5DT2		(*(uchar *)0x00801158)
#define	C0MSL5DT3		(*(uchar *)0x00801159)
#define	C0MSL5DT4		(*(uchar *)0x0080115A)
#define	C0MSL5DT5		(*(uchar *)0x0080115B)
#define	C0MSL5DT6		(*(uchar *)0x0080115C)
#define	C0MSL5DT7		(*(uchar *)0x0080115D)
#define	C0MSL5TSP		(*(ushort *)0x0080115E)

#define	C0MSL6SID0		(*(uchar *)0x00801160)
#define	C0MSL6SID1		(*(uchar *)0x00801161)
#define	C0MSL6EID0		(*(uchar *)0x00801162)
#define	C0MSL6EID1		(*(uchar *)0x00801163)
#define	C0MSL6EID2		(*(uchar *)0x00801164)
#define	C0MSL6DLC		(*(uchar *)0x00801165)
#define	C0MSL6DT0		(*(uchar *)0x00801166)
#define	C0MSL6DT1		(*(uchar *)0x00801167)
#define	C0MSL6DT2		(*(uchar *)0x00801168)
#define	C0MSL6DT3		(*(uchar *)0x00801169)
#define	C0MSL6DT4		(*(uchar *)0x0080116A)
#define	C0MSL6DT5		(*(uchar *)0x0080116B)
#define	C0MSL6DT6		(*(uchar *)0x0080116C)
#define	C0MSL6DT7		(*(uchar *)0x0080116D)
#define	C0MSL6TSP		(*(ushort *)0x0080116E)

#define	C0MSL7SID0		(*(uchar *)0x00801170)
#define	C0MSL7SID1		(*(uchar *)0x00801171)
#define	C0MSL7EID0		(*(uchar *)0x00801172)
#define	C0MSL7EID1		(*(uchar *)0x00801173)
#define	C0MSL7EID2		(*(uchar *)0x00801174)
#define	C0MSL7DLC		(*(uchar *)0x00801175)
#define	C0MSL7DT0		(*(uchar *)0x00801176)
#define	C0MSL7DT1		(*(uchar *)0x00801177)
#define	C0MSL7DT2		(*(uchar *)0x00801178)
#define	C0MSL7DT3		(*(uchar *)0x00801179)
#define	C0MSL7DT4		(*(uchar *)0x0080117A)
#define	C0MSL7DT5		(*(uchar *)0x0080117B)
#define	C0MSL7DT6		(*(uchar *)0x0080117C)
#define	C0MSL7DT7		(*(uchar *)0x0080117D)
#define	C0MSL7TSP		(*(ushort *)0x0080117E)

#define	C0MSL8SID0		(*(uchar *)0x00801180)
#define	C0MSL8SID1		(*(uchar *)0x00801181)
#define	C0MSL8EID0		(*(uchar *)0x00801182)
#define	C0MSL8EID1		(*(uchar *)0x00801183)
#define	C0MSL8EID2		(*(uchar *)0x00801184)
#define	C0MSL8DLC		(*(uchar *)0x00801185)
#define	C0MSL8DT0		(*(uchar *)0x00801186)
#define	C0MSL8DT1		(*(uchar *)0x00801187)
#define	C0MSL8DT2		(*(uchar *)0x00801188)
#define	C0MSL8DT3		(*(uchar *)0x00801189)
#define	C0MSL8DT4		(*(uchar *)0x0080118A)
#define	C0MSL8DT5		(*(uchar *)0x0080118B)
#define	C0MSL8DT6		(*(uchar *)0x0080118C)
#define	C0MSL8DT7		(*(uchar *)0x0080118D)
#define	C0MSL8TSP		(*(ushort *)0x0080118E)

#define	C0MSL9SID0		(*(uchar *)0x00801190)
#define	C0MSL9SID1		(*(uchar *)0x00801191)
#define	C0MSL9EID0		(*(uchar *)0x00801192)
#define	C0MSL9EID1		(*(uchar *)0x00801193)
#define	C0MSL9EID2		(*(uchar *)0x00801194)
#define	C0MSL9DLC		(*(uchar *)0x00801195)
#define	C0MSL9DT0		(*(uchar *)0x00801196)
#define	C0MSL9DT1		(*(uchar *)0x00801197)
#define	C0MSL9DT2		(*(uchar *)0x00801198)
#define	C0MSL9DT3		(*(uchar *)0x00801199)
#define	C0MSL9DT4		(*(uchar *)0x0080119A)
#define	C0MSL9DT5		(*(uchar *)0x0080119B)
#define	C0MSL9DT6		(*(uchar *)0x0080119C)
#define	C0MSL9DT7		(*(uchar *)0x0080119D)
#define	C0MSL9TSP		(*(ushort *)0x0080119E)

#define	C0MSL10SID0		(*(uchar *)0x008011A0)
#define	C0MSL10SID1		(*(uchar *)0x008011A1)
#define	C0MSL10EID0		(*(uchar *)0x008011A2)
#define	C0MSL10EID1		(*(uchar *)0x008011A3)
#define	C0MSL10EID2		(*(uchar *)0x008011A4)
#define	C0MSL10DLC		(*(uchar *)0x008011A5)
#define	C0MSL10DT0		(*(uchar *)0x008011A6)
#define	C0MSL10DT1		(*(uchar *)0x008011A7)
#define	C0MSL10DT2		(*(uchar *)0x008011A8)
#define	C0MSL10DT3		(*(uchar *)0x008011A9)
#define	C0MSL10DT4		(*(uchar *)0x008011AA)
#define	C0MSL10DT5		(*(uchar *)0x008011AB)
#define	C0MSL10DT6		(*(uchar *)0x008011AC)
#define	C0MSL10DT7		(*(uchar *)0x008011AD)
#define	C0MSL10TSP		(*(ushort *)0x008011AE)

#define	C0MSL11SID0		(*(uchar *)0x008011B0)
#define	C0MSL11SID1		(*(uchar *)0x008011B1)
#define	C0MSL11EID0		(*(uchar *)0x008011B2)
#define	C0MSL11EID1		(*(uchar *)0x008011B3)
#define	C0MSL11EID2		(*(uchar *)0x008011B4)
#define	C0MSL11DLC		(*(uchar *)0x008011B5)
#define	C0MSL11DT0		(*(uchar *)0x008011B6)
#define	C0MSL11DT1		(*(uchar *)0x008011B7)
#define	C0MSL11DT2		(*(uchar *)0x008011B8)
#define	C0MSL11DT3		(*(uchar *)0x008011B9)
#define	C0MSL11DT4		(*(uchar *)0x008011BA)
#define	C0MSL11DT5		(*(uchar *)0x008011BB)
#define	C0MSL11DT6		(*(uchar *)0x008011BC)
#define	C0MSL11DT7		(*(uchar *)0x008011BD)
#define	C0MSL11TSP		(*(ushort *)0x008011BE)

#define	C0MSL12SID0		(*(uchar *)0x008011C0)
#define	C0MSL12SID1		(*(uchar *)0x008011C1)
#define	C0MSL12EID0		(*(uchar *)0x008011C2)
#define	C0MSL12EID1		(*(uchar *)0x008011C3)
#define	C0MSL12EID2		(*(uchar *)0x008011C4)
#define	C0MSL12DLC		(*(uchar *)0x008011C5)
#define	C0MSL12DT0		(*(uchar *)0x008011C6)
#define	C0MSL12DT1		(*(uchar *)0x008011C7)
#define	C0MSL12DT2		(*(uchar *)0x008011C8)
#define	C0MSL12DT3		(*(uchar *)0x008011C9)
#define	C0MSL12DT4		(*(uchar *)0x008011CA)
#define	C0MSL12DT5		(*(uchar *)0x008011CB)
#define	C0MSL12DT6		(*(uchar *)0x008011CC)
#define	C0MSL12DT7		(*(uchar *)0x008011CD)
#define	C0MSL12TSP		(*(ushort *)0x008011CE)

#define	C0MSL13SID0		(*(uchar *)0x008011D0)
#define	C0MSL13SID1		(*(uchar *)0x008011D1)
#define	C0MSL13EID0		(*(uchar *)0x008011D2)
#define	C0MSL13EID1		(*(uchar *)0x008011D3)
#define	C0MSL13EID2		(*(uchar *)0x008011D4)
#define	C0MSL13DLC		(*(uchar *)0x008011D5)
#define	C0MSL13DT0		(*(uchar *)0x008011D6)
#define	C0MSL13DT1		(*(uchar *)0x008011D7)
#define	C0MSL13DT2		(*(uchar *)0x008011D8)
#define	C0MSL13DT3		(*(uchar *)0x008011D9)
#define	C0MSL13DT4		(*(uchar *)0x008011DA)
#define	C0MSL13DT5		(*(uchar *)0x008011DB)
#define	C0MSL13DT6		(*(uchar *)0x008011DC)
#define	C0MSL13DT7		(*(uchar *)0x008011DD)
#define	C0MSL13TSP		(*(ushort *)0x008011DE)

#define	C0MSL14SID0		(*(uchar *)0x008011E0)
#define	C0MSL14SID1		(*(uchar *)0x008011E1)
#define	C0MSL14EID0		(*(uchar *)0x008011E2)
#define	C0MSL14EID1		(*(uchar *)0x008011E3)
#define	C0MSL14EID2		(*(uchar *)0x008011E4)
#define	C0MSL14DLC		(*(uchar *)0x008011E5)
#define	C0MSL14DT0		(*(uchar *)0x008011E6)
#define	C0MSL14DT1		(*(uchar *)0x008011E7)
#define	C0MSL14DT2		(*(uchar *)0x008011E8)
#define	C0MSL14DT3		(*(uchar *)0x008011E9)
#define	C0MSL14DT4		(*(uchar *)0x008011EA)
#define	C0MSL14DT5		(*(uchar *)0x008011EB)
#define	C0MSL14DT6		(*(uchar *)0x008011EC)
#define	C0MSL14DT7		(*(uchar *)0x008011ED)
#define	C0MSL14TSP		(*(ushort *)0x008011EE)

#define	C0MSL15SID0		(*(uchar *)0x008011F0)
#define	C0MSL15SID1		(*(uchar *)0x008011F1)
#define	C0MSL15EID0		(*(uchar *)0x008011F2)
#define	C0MSL15EID1		(*(uchar *)0x008011F3)
#define	C0MSL15EID2		(*(uchar *)0x008011F4)
#define	C0MSL15DLC		(*(uchar *)0x008011F5)
#define	C0MSL15DT0		(*(uchar *)0x008011F6)
#define	C0MSL15DT1		(*(uchar *)0x008011F7)
#define	C0MSL15DT2		(*(uchar *)0x008011F8)
#define	C0MSL15DT3		(*(uchar *)0x008011F9)
#define	C0MSL15DT4		(*(uchar *)0x008011FA)
#define	C0MSL15DT5		(*(uchar *)0x008011FB)
#define	C0MSL15DT6		(*(uchar *)0x008011FC)
#define	C0MSL15DT7		(*(uchar *)0x008011FD)
#define	C0MSL15TSP		(*(ushort *)0x008011FE)

