Ihara-Hideki/BZ5_RX66T/workspace/BZ5/src/common/compile/H/SfrRegister.h
#ifdef __M32186
	#define	C0MSL16SID0		(*(uchar *)0x00801200)
	#define	C0MSL16SID1		(*(uchar *)0x00801201)
	#define	C0MSL16EID0		(*(uchar *)0x00801202)
	#define	C0MSL16EID1		(*(uchar *)0x00801203)
	#define	C0MSL16EID2		(*(uchar *)0x00801204)
	#define	C0MSL16DLC		(*(uchar *)0x00801205)
	#define	C0MSL16DT0		(*(uchar *)0x00801206)
	#define	C0MSL16DT1		(*(uchar *)0x00801207)
	#define	C0MSL16DT2		(*(uchar *)0x00801208)
	#define	C0MSL16DT3		(*(uchar *)0x00801209)
	#define	C0MSL16DT4		(*(uchar *)0x0080120A)
	#define	C0MSL16DT5		(*(uchar *)0x0080120B)
	#define	C0MSL16DT6		(*(uchar *)0x0080120C)
	#define	C0MSL16DT7		(*(uchar *)0x0080120D)
	#define	C0MSL16TSP		(*(ushort *)0x0080120E)

	#define	C0MSL17SID0		(*(uchar *)0x00801210)
	#define	C0MSL17SID1		(*(uchar *)0x00801211)
	#define	C0MSL17EID0		(*(uchar *)0x00801212)
	#define	C0MSL17EID1		(*(uchar *)0x00801213)
	#define	C0MSL17EID2		(*(uchar *)0x00801214)
	#define	C0MSL17DLC		(*(uchar *)0x00801215)
	#define	C0MSL17DT0		(*(uchar *)0x00801216)
	#define	C0MSL17DT1		(*(uchar *)0x00801217)
	#define	C0MSL17DT2		(*(uchar *)0x00801218)
	#define	C0MSL17DT3		(*(uchar *)0x00801219)
	#define	C0MSL17DT4		(*(uchar *)0x0080121A)
	#define	C0MSL17DT5		(*(uchar *)0x0080121B)
	#define	C0MSL17DT6		(*(uchar *)0x0080121C)
	#define	C0MSL17DT7		(*(uchar *)0x0080121D)
	#define	C0MSL17TSP		(*(ushort *)0x0080121E)

	#define	C0MSL18SID0		(*(uchar *)0x00801220)
	#define	C0MSL18SID1		(*(uchar *)0x00801221)
	#define	C0MSL18EID0		(*(uchar *)0x00801222)
	#define	C0MSL18EID1		(*(uchar *)0x00801223)
	#define	C0MSL18EID2		(*(uchar *)0x00801224)
	#define	C0MSL18DLC		(*(uchar *)0x00801225)
	#define	C0MSL18DT0		(*(uchar *)0x00801226)
	#define	C0MSL18DT1		(*(uchar *)0x00801227)
	#define	C0MSL18DT2		(*(uchar *)0x00801228)
	#define	C0MSL18DT3		(*(uchar *)0x00801229)
	#define	C0MSL18DT4		(*(uchar *)0x0080122A)
	#define	C0MSL18DT5		(*(uchar *)0x0080122B)
	#define	C0MSL18DT6		(*(uchar *)0x0080122C)
	#define	C0MSL18DT7		(*(uchar *)0x0080122D)
	#define	C0MSL18TSP		(*(ushort *)0x0080122E)

	#define	C0MSL19SID0		(*(uchar *)0x00801230)
	#define	C0MSL19SID1		(*(uchar *)0x00801231)
	#define	C0MSL19EID0		(*(uchar *)0x00801232)
	#define	C0MSL19EID1		(*(uchar *)0x00801233)
	#define	C0MSL19EID2		(*(uchar *)0x00801234)
	#define	C0MSL19DLC		(*(uchar *)0x00801235)
	#define	C0MSL19DT0		(*(uchar *)0x00801236)
	#define	C0MSL19DT1		(*(uchar *)0x00801237)
	#define	C0MSL19DT2		(*(uchar *)0x00801238)
	#define	C0MSL19DT3		(*(uchar *)0x00801239)
	#define	C0MSL19DT4		(*(uchar *)0x0080123A)
	#define	C0MSL19DT5		(*(uchar *)0x0080123B)
	#define	C0MSL19DT6		(*(uchar *)0x0080123C)
	#define	C0MSL19DT7		(*(uchar *)0x0080123D)
	#define	C0MSL19TSP		(*(ushort *)0x0080123E)

	#define	C0MSL20SID0		(*(uchar *)0x00801240)
	#define	C0MSL20SID1		(*(uchar *)0x00801241)
	#define	C0MSL20EID0		(*(uchar *)0x00801242)
	#define	C0MSL20EID1		(*(uchar *)0x00801243)
	#define	C0MSL20EID2		(*(uchar *)0x00801244)
	#define	C0MSL20DLC		(*(uchar *)0x00801245)
	#define	C0MSL20DT0		(*(uchar *)0x00801246)
	#define	C0MSL20DT1		(*(uchar *)0x00801247)
	#define	C0MSL20DT2		(*(uchar *)0x00801248)
	#define	C0MSL20DT3		(*(uchar *)0x00801249)
	#define	C0MSL20DT4		(*(uchar *)0x0080124A)
	#define	C0MSL20DT5		(*(uchar *)0x0080124B)
	#define	C0MSL20DT6		(*(uchar *)0x0080124C)
	#define	C0MSL20DT7		(*(uchar *)0x0080124D)
	#define	C0MSL20TSP		(*(ushort *)0x0080124E)

	#define	C0MSL21SID0		(*(uchar *)0x00801250)
	#define	C0MSL21SID1		(*(uchar *)0x00801251)
	#define	C0MSL21EID0		(*(uchar *)0x00801252)
	#define	C0MSL21EID1		(*(uchar *)0x00801253)
	#define	C0MSL21EID2		(*(uchar *)0x00801254)
	#define	C0MSL21DLC		(*(uchar *)0x00801255)
	#define	C0MSL21DT0		(*(uchar *)0x00801256)
	#define	C0MSL21DT1		(*(uchar *)0x00801257)
	#define	C0MSL21DT2		(*(uchar *)0x00801258)
	#define	C0MSL21DT3		(*(uchar *)0x00801259)
	#define	C0MSL21DT4		(*(uchar *)0x0080125A)
	#define	C0MSL21DT5		(*(uchar *)0x0080125B)
	#define	C0MSL21DT6		(*(uchar *)0x0080125C)
	#define	C0MSL21DT7		(*(uchar *)0x0080125D)
	#define	C0MSL21TSP		(*(ushort *)0x0080125E)

	#define	C0MSL22SID0		(*(uchar *)0x00801260)
	#define	C0MSL22SID1		(*(uchar *)0x00801261)
	#define	C0MSL22EID0		(*(uchar *)0x00801262)
	#define	C0MSL22EID1		(*(uchar *)0x00801263)
	#define	C0MSL22EID2		(*(uchar *)0x00801264)
	#define	C0MSL22DLC		(*(uchar *)0x00801265)
	#define	C0MSL22DT0		(*(uchar *)0x00801266)
	#define	C0MSL22DT1		(*(uchar *)0x00801267)
	#define	C0MSL22DT2		(*(uchar *)0x00801268)
	#define	C0MSL22DT3		(*(uchar *)0x00801269)
	#define	C0MSL22DT4		(*(uchar *)0x0080126A)
	#define	C0MSL22DT5		(*(uchar *)0x0080126B)
	#define	C0MSL22DT6		(*(uchar *)0x0080126C)
	#define	C0MSL22DT7		(*(uchar *)0x0080126D)
	#define	C0MSL22TSP		(*(ushort *)0x0080126E)

	#define	C0MSL23SID0		(*(uchar *)0x00801270)
	#define	C0MSL23SID1		(*(uchar *)0x00801271)
	#define	C0MSL23EID0		(*(uchar *)0x00801272)
	#define	C0MSL23EID1		(*(uchar *)0x00801273)
	#define	C0MSL23EID2		(*(uchar *)0x00801274)
	#define	C0MSL23DLC		(*(uchar *)0x00801275)
	#define	C0MSL23DT0		(*(uchar *)0x00801276)
	#define	C0MSL23DT1		(*(uchar *)0x00801277)
	#define	C0MSL23DT2		(*(uchar *)0x00801278)
	#define	C0MSL23DT3		(*(uchar *)0x00801279)
	#define	C0MSL23DT4		(*(uchar *)0x0080127A)
	#define	C0MSL23DT5		(*(uchar *)0x0080127B)
	#define	C0MSL23DT6		(*(uchar *)0x0080127C)
	#define	C0MSL23DT7		(*(uchar *)0x0080127D)
	#define	C0MSL23TSP		(*(ushort *)0x0080127E)

	#define	C0MSL24SID0		(*(uchar *)0x00801280)
	#define	C0MSL24SID1		(*(uchar *)0x00801281)
	#define	C0MSL24EID0		(*(uchar *)0x00801282)
	#define	C0MSL24EID1		(*(uchar *)0x00801283)
	#define	C0MSL24EID2		(*(uchar *)0x00801284)
	#define	C0MSL24DLC		(*(uchar *)0x00801285)
	#define	C0MSL24DT0		(*(uchar *)0x00801286)
	#define	C0MSL24DT1		(*(uchar *)0x00801287)
	#define	C0MSL24DT2		(*(uchar *)0x00801288)
	#define	C0MSL24DT3		(*(uchar *)0x00801289)
	#define	C0MSL24DT4		(*(uchar *)0x0080128A)
	#define	C0MSL24DT5		(*(uchar *)0x0080128B)
	#define	C0MSL24DT6		(*(uchar *)0x0080128C)
	#define	C0MSL24DT7		(*(uchar *)0x0080128D)
	#define	C0MSL24TSP		(*(ushort *)0x0080128E)

	#define	C0MSL25SID0		(*(uchar *)0x00801290)
	#define	C0MSL25SID1		(*(uchar *)0x00801291)
	#define	C0MSL25EID0		(*(uchar *)0x00801292)
	#define	C0MSL25EID1		(*(uchar *)0x00801293)
	#define	C0MSL25EID2		(*(uchar *)0x00801294)
	#define	C0MSL25DLC		(*(uchar *)0x00801295)
	#define	C0MSL25DT0		(*(uchar *)0x00801296)
	#define	C0MSL25DT1		(*(uchar *)0x00801297)
	#define	C0MSL25DT2		(*(uchar *)0x00801298)
	#define	C0MSL25DT3		(*(uchar *)0x00801299)
	#define	C0MSL25DT4		(*(uchar *)0x0080129A)
	#define	C0MSL25DT5		(*(uchar *)0x0080129B)
	#define	C0MSL25DT6		(*(uchar *)0x0080129C)
	#define	C0MSL25DT7		(*(uchar *)0x0080129D)
	#define	C0MSL25TSP		(*(ushort *)0x0080129E)

	#define	C0MSL26SID0		(*(uchar *)0x008012A0)
	#define	C0MSL26SID1		(*(uchar *)0x008012A1)
	#define	C0MSL26EID0		(*(uchar *)0x008012A2)
	#define	C0MSL26EID1		(*(uchar *)0x008012A3)
	#define	C0MSL26EID2		(*(uchar *)0x008012A4)
	#define	C0MSL26DLC		(*(uchar *)0x008012A5)
	#define	C0MSL26DT0		(*(uchar *)0x008012A6)
	#define	C0MSL26DT1		(*(uchar *)0x008012A7)
	#define	C0MSL26DT2		(*(uchar *)0x008012A8)
	#define	C0MSL26DT3		(*(uchar *)0x008012A9)
	#define	C0MSL26DT4		(*(uchar *)0x008012AA)
	#define	C0MSL26DT5		(*(uchar *)0x008012AB)
	#define	C0MSL26DT6		(*(uchar *)0x008012AC)
	#define	C0MSL26DT7		(*(uchar *)0x008012AD)
	#define	C0MSL26TSP		(*(ushort *)0x008012AE)

