Ihara-Hideki/BZ5_RX66T/workspace/BZ5/src/common/compile/H/SfrRegister.h
	#define	C0MSL27SID0		(*(uchar *)0x008012B0)
	#define	C0MSL27SID1		(*(uchar *)0x008012B1)
	#define	C0MSL27EID0		(*(uchar *)0x008012B2)
	#define	C0MSL27EID1		(*(uchar *)0x008012B3)
	#define	C0MSL27EID2		(*(uchar *)0x008012B4)
	#define	C0MSL27DLC		(*(uchar *)0x008012B5)
	#define	C0MSL27DT0		(*(uchar *)0x008012B6)
	#define	C0MSL27DT1		(*(uchar *)0x008012B7)
	#define	C0MSL27DT2		(*(uchar *)0x008012B8)
	#define	C0MSL27DT3		(*(uchar *)0x008012B9)
	#define	C0MSL27DT4		(*(uchar *)0x008012BA)
	#define	C0MSL27DT5		(*(uchar *)0x008012BB)
	#define	C0MSL27DT6		(*(uchar *)0x008012BC)
	#define	C0MSL27DT7		(*(uchar *)0x008012BD)
	#define	C0MSL27TSP		(*(ushort *)0x008012BE)

	#define	C0MSL28SID0		(*(uchar *)0x008012C0)
	#define	C0MSL28SID1		(*(uchar *)0x008012C1)
	#define	C0MSL28EID0		(*(uchar *)0x008012C2)
	#define	C0MSL28EID1		(*(uchar *)0x008012C3)
	#define	C0MSL28EID2		(*(uchar *)0x008012C4)
	#define	C0MSL28DLC		(*(uchar *)0x008012C5)
	#define	C0MSL28DT0		(*(uchar *)0x008012C6)
	#define	C0MSL28DT1		(*(uchar *)0x008012C7)
	#define	C0MSL28DT2		(*(uchar *)0x008012C8)
	#define	C0MSL28DT3		(*(uchar *)0x008012C9)
	#define	C0MSL28DT4		(*(uchar *)0x008012CA)
	#define	C0MSL28DT5		(*(uchar *)0x008012CB)
	#define	C0MSL28DT6		(*(uchar *)0x008012CC)
	#define	C0MSL28DT7		(*(uchar *)0x008012CD)
	#define	C0MSL28TSP		(*(ushort *)0x008012CE)

	#define	C0MSL29SID0		(*(uchar *)0x008012D0)
	#define	C0MSL29SID1		(*(uchar *)0x008012D1)
	#define	C0MSL29EID0		(*(uchar *)0x008012D2)
	#define	C0MSL29EID1		(*(uchar *)0x008012D3)
	#define	C0MSL29EID2		(*(uchar *)0x008012D4)
	#define	C0MSL29DLC		(*(uchar *)0x008012D5)
	#define	C0MSL29DT0		(*(uchar *)0x008012D6)
	#define	C0MSL29DT1		(*(uchar *)0x008012D7)
	#define	C0MSL29DT2		(*(uchar *)0x008012D8)
	#define	C0MSL29DT3		(*(uchar *)0x008012D9)
	#define	C0MSL29DT4		(*(uchar *)0x008012DA)
	#define	C0MSL29DT5		(*(uchar *)0x008012DB)
	#define	C0MSL29DT6		(*(uchar *)0x008012DC)
	#define	C0MSL29DT7		(*(uchar *)0x008012DD)
	#define	C0MSL29TSP		(*(ushort *)0x008012DE)

	#define	C0MSL30SID0		(*(uchar *)0x008012E0)
	#define	C0MSL30SID1		(*(uchar *)0x008012E1)
	#define	C0MSL30EID0		(*(uchar *)0x008012E2)
	#define	C0MSL30EID1		(*(uchar *)0x008012E3)
	#define	C0MSL30EID2		(*(uchar *)0x008012E4)
	#define	C0MSL30DLC		(*(uchar *)0x008012E5)
	#define	C0MSL30DT0		(*(uchar *)0x008012E6)
	#define	C0MSL30DT1		(*(uchar *)0x008012E7)
	#define	C0MSL30DT2		(*(uchar *)0x008012E8)
	#define	C0MSL30DT3		(*(uchar *)0x008012E9)
	#define	C0MSL30DT4		(*(uchar *)0x008012EA)
	#define	C0MSL30DT5		(*(uchar *)0x008012EB)
	#define	C0MSL30DT6		(*(uchar *)0x008012EC)
	#define	C0MSL30DT7		(*(uchar *)0x008012ED)
	#define	C0MSL30TSP		(*(ushort *)0x008012EE)

	#define	C0MSL31SID0		(*(uchar *)0x008012F0)
	#define	C0MSL31SID1		(*(uchar *)0x008012F1)
	#define	C0MSL31EID0		(*(uchar *)0x008012F2)
	#define	C0MSL31EID1		(*(uchar *)0x008012F3)
	#define	C0MSL31EID2		(*(uchar *)0x008012F4)
	#define	C0MSL31DLC		(*(uchar *)0x008012F5)
	#define	C0MSL31DT0		(*(uchar *)0x008012F6)
	#define	C0MSL31DT1		(*(uchar *)0x008012F7)
	#define	C0MSL31DT2		(*(uchar *)0x008012F8)
	#define	C0MSL31DT3		(*(uchar *)0x008012F9)
	#define	C0MSL31DT4		(*(uchar *)0x008012FA)
	#define	C0MSL31DT5		(*(uchar *)0x008012FB)
	#define	C0MSL31DT6		(*(uchar *)0x008012FC)
	#define	C0MSL31DT7		(*(uchar *)0x008012FD)
	#define	C0MSL31TSP		(*(ushort *)0x008012FE)

	#define	CAN1CNT			(*(ushort *)0x00801400)
	#define	CAN1STAT		(*(ushort *)0x00801402)
	#define	CAN1EXTID		(*(ushort *)0x00801404)
	#define	CAN1CONF		(*(ushort *)0x00801406)
	#define	CAN1TSTMP		(*(ushort *)0x00801408)
	#define	CAN1REC			(*(uchar *)0x0080140A)
	#define	CAN1TEC			(*(uchar *)0x0080140B)
	#define	CAN1SLISTW		(*(ulong *)0x0080140C)
	#define	CAN1SLIST		(*(ushort *)0x0080140C)
	#define	CAN1SLISTL		(*(ushort *)0x0080140E)
	#define	CAN1SLIMKW		(*(ulong *)0x00801410)
	#define	CAN1SLIMK		(*(ushort *)0x00801410)
	#define	CAN1SLIMKL		(*(ushort *)0x00801412)
	#define	CAN1ERIST		(*(uchar *)0x00801414)
	#define	CAN1ERIMK		(*(uchar *)0x00801415)
	#define	CAN1BRP			(*(uchar *)0x00801416)
	#define	CAN1MOD			(*(uchar *)0x00801418)
	#define	CAN1DMARQ		(*(uchar *)0x00801419)
	#define	CAN1MSN			(*(uchar *)0x0080141A)
	#define	CAN1CKSEL		(*(uchar *)0x0080141B)

	#define	CAN1FFSW		(*(ulong *)0x0080141C)
	#define	CAN1FFS			(*(ushort *)0x0080141C)
	#define	CAN1FFSL		(*(ushort *)0x0080141E)

	#define	C1GMSKAS0		(*(uchar *)0x00801420)
	#define	C1GMSKAS1		(*(uchar *)0x00801421)
	#define	C1GMSKAE0		(*(uchar *)0x00801422)
	#define	C1GMSKAE1		(*(uchar *)0x00801423)
	#define	C1GMSKAE2		(*(uchar *)0x00801424)

	#define	C1GMSKBS0		(*(uchar *)0x00801428)
	#define	C1GMSKBS1		(*(uchar *)0x00801429)
	#define	C1GMSKBE0		(*(uchar *)0x0080142A)
	#define	C1GMSKBE1		(*(uchar *)0x0080142B)
	#define	C1GMSKBE2		(*(uchar *)0x0080142C)

	#define	C1LMSKAS0		(*(uchar *)0x00801430)
	#define	C1LMSKAS1		(*(uchar *)0x00801431)
	#define	C1LMSKAE0		(*(uchar *)0x00801432)
	#define	C1LMSKAE1		(*(uchar *)0x00801433)
	#define	C1LMSKAE2		(*(uchar *)0x00801434)

	#define	C1LMSKBS0		(*(uchar *)0x00801438)
	#define	C1LMSKBS1		(*(uchar *)0x00801439)
	#define	C1LMSKBE0		(*(uchar *)0x0080143A)
	#define	C1LMSKBE1		(*(uchar *)0x0080143B)
	#define	C1LMSKBE2		(*(uchar *)0x0080143C)

	#define	CAN1SSMODEW		(*(ulong *)0x00801440)
	#define	CAN1SSMODE		(*(ushort *)0x00801440)
	#define	CAN1SSMODEL		(*(ushort *)0x00801442)

	#define	CAN1SSISTW		(*(ulong *)0x00801444)
	#define	CAN1SSIST		(*(ushort *)0x00801444)
	#define	CAN1SSISTL		(*(ushort *)0x00801446)

	#define	CAN1SSIMKW		(*(ulong *)0x00801448)
	#define	CAN1SSIMK		(*(ushort *)0x00801448)
	#define	CAN1SSIMKL		(*(ushort *)0x0080144A)

	#define	C1MSL0CNT		(*(uchar *)0x00801450)
	#define	C1MSL1CNT		(*(uchar *)0x00801451)
	#define	C1MSL2CNT		(*(uchar *)0x00801452)
	#define	C1MSL3CNT		(*(uchar *)0x00801453)
	#define	C1MSL4CNT		(*(uchar *)0x00801454)
	#define	C1MSL5CNT		(*(uchar *)0x00801455)
	#define	C1MSL6CNT		(*(uchar *)0x00801456)
	#define	C1MSL7CNT		(*(uchar *)0x00801457)
	#define	C1MSL8CNT		(*(uchar *)0x00801458)
	#define	C1MSL9CNT		(*(uchar *)0x00801459)
	#define	C1MSL10CNT		(*(uchar *)0x0080145A)
	#define	C1MSL11CNT		(*(uchar *)0x0080145B)
	#define	C1MSL12CNT		(*(uchar *)0x0080145C)
	#define	C1MSL13CNT		(*(uchar *)0x0080145D)
	#define	C1MSL14CNT		(*(uchar *)0x0080145E)
	#define	C1MSL15CNT		(*(uchar *)0x0080145F)
	#define	C1MSL16CNT		(*(uchar *)0x00801460)
	#define	C1MSL17CNT		(*(uchar *)0x00801461)
	#define	C1MSL18CNT		(*(uchar *)0x00801462)
	#define	C1MSL19CNT		(*(uchar *)0x00801463)
	#define	C1MSL20CNT		(*(uchar *)0x00801464)
	#define	C1MSL21CNT		(*(uchar *)0x00801465)
	#define	C1MSL22CNT		(*(uchar *)0x00801466)
	#define	C1MSL23CNT		(*(uchar *)0x00801467)
	#define	C1MSL24CNT		(*(uchar *)0x00801468)
	#define	C1MSL25CNT		(*(uchar *)0x00801469)
	#define	C1MSL26CNT		(*(uchar *)0x0080146A)
	#define	C1MSL27CNT		(*(uchar *)0x0080146B)
	#define	C1MSL28CNT		(*(uchar *)0x0080146C)
	#define	C1MSL29CNT		(*(uchar *)0x0080146D)
	#define	C1MSL30CNT		(*(uchar *)0x0080146E)
	#define	C1MSL31CNT		(*(uchar *)0x0080146F)

	#define	C1MSL0SID0		(*(uchar *)0x00801500)
	#define	C1MSL0SID1		(*(uchar *)0x00801501)
	#define	C1MSL0EID0		(*(uchar *)0x00801502)
	#define	C1MSL0EID1		(*(uchar *)0x00801503)
	#define	C1MSL0EID2		(*(uchar *)0x00801504)
	#define	C1MSL0DLC		(*(uchar *)0x00801505)
	#define	C1MSL0DT0		(*(uchar *)0x00801506)
	#define	C1MSL0DT1		(*(uchar *)0x00801507)
	#define	C1MSL0DT2		(*(uchar *)0x00801508)
	#define	C1MSL0DT3		(*(uchar *)0x00801509)
	#define	C1MSL0DT4		(*(uchar *)0x0080150A)
	#define	C1MSL0DT5		(*(uchar *)0x0080150B)
	#define	C1MSL0DT6		(*(uchar *)0x0080150C)
	#define	C1MSL0DT7		(*(uchar *)0x0080150D)
	#define	C1MSL0TSP		(*(ushort *)0x0080150E)

	#define	C1MSL1SID0		(*(uchar *)0x00801510)
	#define	C1MSL1SID1		(*(uchar *)0x00801511)
	#define	C1MSL1EID0		(*(uchar *)0x00801512)
	#define	C1MSL1EID1		(*(uchar *)0x00801513)
	#define	C1MSL1EID2		(*(uchar *)0x00801514)
	#define	C1MSL1DLC		(*(uchar *)0x00801515)
	#define	C1MSL1DT0		(*(uchar *)0x00801516)
	#define	C1MSL1DT1		(*(uchar *)0x00801517)
	#define	C1MSL1DT2		(*(uchar *)0x00801518)
	#define	C1MSL1DT3		(*(uchar *)0x00801519)
	#define	C1MSL1DT4		(*(uchar *)0x0080151A)
	#define	C1MSL1DT5		(*(uchar *)0x0080151B)
	#define	C1MSL1DT6		(*(uchar *)0x0080151C)
	#define	C1MSL1DT7		(*(uchar *)0x0080151D)
	#define	C1MSL1TSP		(*(ushort *)0x0080151E)

	#define	C1MSL2SID0		(*(uchar *)0x00801520)
	#define	C1MSL2SID1		(*(uchar *)0x00801521)
	#define	C1MSL2EID0		(*(uchar *)0x00801522)
	#define	C1MSL2EID1		(*(uchar *)0x00801523)
	#define	C1MSL2EID2		(*(uchar *)0x00801524)
	#define	C1MSL2DLC		(*(uchar *)0x00801525)
	#define	C1MSL2DT0		(*(uchar *)0x00801526)
	#define	C1MSL2DT1		(*(uchar *)0x00801527)
	#define	C1MSL2DT2		(*(uchar *)0x00801528)
	#define	C1MSL2DT3		(*(uchar *)0x00801529)
	#define	C1MSL2DT4		(*(uchar *)0x0080152A)
	#define	C1MSL2DT5		(*(uchar *)0x0080152B)
	#define	C1MSL2DT6		(*(uchar *)0x0080152C)
	#define	C1MSL2DT7		(*(uchar *)0x0080152D)
	#define	C1MSL2TSP		(*(ushort *)0x0080152E)

