Ihara-Hideki/BZ5_RX66T/workspace/BZ5/src/common/compile/H/SfrRegister.h
	#define	C1MSL3SID0		(*(uchar *)0x00801530)
	#define	C1MSL3SID1		(*(uchar *)0x00801531)
	#define	C1MSL3EID0		(*(uchar *)0x00801532)
	#define	C1MSL3EID1		(*(uchar *)0x00801533)
	#define	C1MSL3EID2		(*(uchar *)0x00801534)
	#define	C1MSL3DLC		(*(uchar *)0x00801535)
	#define	C1MSL3DT0		(*(uchar *)0x00801536)
	#define	C1MSL3DT1		(*(uchar *)0x00801537)
	#define	C1MSL3DT2		(*(uchar *)0x00801538)
	#define	C1MSL3DT3		(*(uchar *)0x00801539)
	#define	C1MSL3DT4		(*(uchar *)0x0080153A)
	#define	C1MSL3DT5		(*(uchar *)0x0080153B)
	#define	C1MSL3DT6		(*(uchar *)0x0080153C)
	#define	C1MSL3DT7		(*(uchar *)0x0080153D)
	#define	C1MSL3TSP		(*(ushort *)0x0080153E)

	#define	C1MSL4SID0		(*(uchar *)0x00801540)
	#define	C1MSL4SID1		(*(uchar *)0x00801541)
	#define	C1MSL4EID0		(*(uchar *)0x00801542)
	#define	C1MSL4EID1		(*(uchar *)0x00801543)
	#define	C1MSL4EID2		(*(uchar *)0x00801544)
	#define	C1MSL4DLC		(*(uchar *)0x00801545)
	#define	C1MSL4DT0		(*(uchar *)0x00801546)
	#define	C1MSL4DT1		(*(uchar *)0x00801547)
	#define	C1MSL4DT2		(*(uchar *)0x00801548)
	#define	C1MSL4DT3		(*(uchar *)0x00801549)
	#define	C1MSL4DT4		(*(uchar *)0x0080154A)
	#define	C1MSL4DT5		(*(uchar *)0x0080154B)
	#define	C1MSL4DT6		(*(uchar *)0x0080154C)
	#define	C1MSL4DT7		(*(uchar *)0x0080154D)
	#define	C1MSL4TSP		(*(ushort *)0x0080154E)

	#define	C1MSL5SID0		(*(uchar *)0x00801550)
	#define	C1MSL5SID1		(*(uchar *)0x00801551)
	#define	C1MSL5EID0		(*(uchar *)0x00801552)
	#define	C1MSL5EID1		(*(uchar *)0x00801553)
	#define	C1MSL5EID2		(*(uchar *)0x00801554)
	#define	C1MSL5DLC		(*(uchar *)0x00801555)
	#define	C1MSL5DT0		(*(uchar *)0x00801556)
	#define	C1MSL5DT1		(*(uchar *)0x00801557)
	#define	C1MSL5DT2		(*(uchar *)0x00801558)
	#define	C1MSL5DT3		(*(uchar *)0x00801559)
	#define	C1MSL5DT4		(*(uchar *)0x0080155A)
	#define	C1MSL5DT5		(*(uchar *)0x0080155B)
	#define	C1MSL5DT6		(*(uchar *)0x0080155C)
	#define	C1MSL5DT7		(*(uchar *)0x0080155D)
	#define	C1MSL5TSP		(*(ushort *)0x0080155E)

	#define	C1MSL6SID0		(*(uchar *)0x00801560)
	#define	C1MSL6SID1		(*(uchar *)0x00801561)
	#define	C1MSL6EID0		(*(uchar *)0x00801562)
	#define	C1MSL6EID1		(*(uchar *)0x00801563)
	#define	C1MSL6EID2		(*(uchar *)0x00801564)
	#define	C1MSL6DLC		(*(uchar *)0x00801565)
	#define	C1MSL6DT0		(*(uchar *)0x00801566)
	#define	C1MSL6DT1		(*(uchar *)0x00801567)
	#define	C1MSL6DT2		(*(uchar *)0x00801568)
	#define	C1MSL6DT3		(*(uchar *)0x00801569)
	#define	C1MSL6DT4		(*(uchar *)0x0080156A)
	#define	C1MSL6DT5		(*(uchar *)0x0080156B)
	#define	C1MSL6DT6		(*(uchar *)0x0080156C)
	#define	C1MSL6DT7		(*(uchar *)0x0080156D)
	#define	C1MSL6TSP		(*(ushort *)0x0080156E)

	#define	C1MSL7SID0		(*(uchar *)0x00801570)
	#define	C1MSL7SID1		(*(uchar *)0x00801571)
	#define	C1MSL7EID0		(*(uchar *)0x00801572)
	#define	C1MSL7EID1		(*(uchar *)0x00801573)
	#define	C1MSL7EID2		(*(uchar *)0x00801574)
	#define	C1MSL7DLC		(*(uchar *)0x00801575)
	#define	C1MSL7DT0		(*(uchar *)0x00801576)
	#define	C1MSL7DT1		(*(uchar *)0x00801577)
	#define	C1MSL7DT2		(*(uchar *)0x00801578)
	#define	C1MSL7DT3		(*(uchar *)0x00801579)
	#define	C1MSL7DT4		(*(uchar *)0x0080157A)
	#define	C1MSL7DT5		(*(uchar *)0x0080157B)
	#define	C1MSL7DT6		(*(uchar *)0x0080157C)
	#define	C1MSL7DT7		(*(uchar *)0x0080157D)
	#define	C1MSL7TSP		(*(ushort *)0x0080157E)

	#define	C1MSL8SID0		(*(uchar *)0x00801580)
	#define	C1MSL8SID1		(*(uchar *)0x00801581)
	#define	C1MSL8EID0		(*(uchar *)0x00801582)
	#define	C1MSL8EID1		(*(uchar *)0x00801583)
	#define	C1MSL8EID2		(*(uchar *)0x00801584)
	#define	C1MSL8DLC		(*(uchar *)0x00801585)
	#define	C1MSL8DT0		(*(uchar *)0x00801586)
	#define	C1MSL8DT1		(*(uchar *)0x00801587)
	#define	C1MSL8DT2		(*(uchar *)0x00801588)
	#define	C1MSL8DT3		(*(uchar *)0x00801589)
	#define	C1MSL8DT4		(*(uchar *)0x0080158A)
	#define	C1MSL8DT5		(*(uchar *)0x0080158B)
	#define	C1MSL8DT6		(*(uchar *)0x0080158C)
	#define	C1MSL8DT7		(*(uchar *)0x0080158D)
	#define	C1MSL8TSP		(*(ushort *)0x0080158E)

	#define	C1MSL9SID0		(*(uchar *)0x00801590)
	#define	C1MSL9SID1		(*(uchar *)0x00801591)
	#define	C1MSL9EID0		(*(uchar *)0x00801592)
	#define	C1MSL9EID1		(*(uchar *)0x00801593)
	#define	C1MSL9EID2		(*(uchar *)0x00801594)
	#define	C1MSL9DLC		(*(uchar *)0x00801595)
	#define	C1MSL9DT0		(*(uchar *)0x00801596)
	#define	C1MSL9DT1		(*(uchar *)0x00801597)
	#define	C1MSL9DT2		(*(uchar *)0x00801598)
	#define	C1MSL9DT3		(*(uchar *)0x00801599)
	#define	C1MSL9DT4		(*(uchar *)0x0080159A)
	#define	C1MSL9DT5		(*(uchar *)0x0080159B)
	#define	C1MSL9DT6		(*(uchar *)0x0080159C)
	#define	C1MSL9DT7		(*(uchar *)0x0080159D)
	#define	C1MSL9TSP		(*(ushort *)0x0080159E)

	#define	C1MSL10SID0		(*(uchar *)0x008015A0)
	#define	C1MSL10SID1		(*(uchar *)0x008015A1)
	#define	C1MSL10EID0		(*(uchar *)0x008015A2)
	#define	C1MSL10EID1		(*(uchar *)0x008015A3)
	#define	C1MSL10EID2		(*(uchar *)0x008015A4)
	#define	C1MSL10DLC		(*(uchar *)0x008015A5)
	#define	C1MSL10DT0		(*(uchar *)0x008015A6)
	#define	C1MSL10DT1		(*(uchar *)0x008015A7)
	#define	C1MSL10DT2		(*(uchar *)0x008015A8)
	#define	C1MSL10DT3		(*(uchar *)0x008015A9)
	#define	C1MSL10DT4		(*(uchar *)0x008015AA)
	#define	C1MSL10DT5		(*(uchar *)0x008015AB)
	#define	C1MSL10DT6		(*(uchar *)0x008015AC)
	#define	C1MSL10DT7		(*(uchar *)0x008015AD)
	#define	C1MSL10TSP		(*(ushort *)0x008015AE)

	#define	C1MSL11SID0		(*(uchar *)0x008015B0)
	#define	C1MSL11SID1		(*(uchar *)0x008015B1)
	#define	C1MSL11EID0		(*(uchar *)0x008015B2)
	#define	C1MSL11EID1		(*(uchar *)0x008015B3)
	#define	C1MSL11EID2		(*(uchar *)0x008015B4)
	#define	C1MSL11DLC		(*(uchar *)0x008015B5)
	#define	C1MSL11DT0		(*(uchar *)0x008015B6)
	#define	C1MSL11DT1		(*(uchar *)0x008015B7)
	#define	C1MSL11DT2		(*(uchar *)0x008015B8)
	#define	C1MSL11DT3		(*(uchar *)0x008015B9)
	#define	C1MSL11DT4		(*(uchar *)0x008015BA)
	#define	C1MSL11DT5		(*(uchar *)0x008015BB)
	#define	C1MSL11DT6		(*(uchar *)0x008015BC)
	#define	C1MSL11DT7		(*(uchar *)0x008015BD)
	#define	C1MSL11TSP		(*(ushort *)0x008015BE)

	#define	C1MSL12SID0		(*(uchar *)0x008015C0)
	#define	C1MSL12SID1		(*(uchar *)0x008015C1)
	#define	C1MSL12EID0		(*(uchar *)0x008015C2)
	#define	C1MSL12EID1		(*(uchar *)0x008015C3)
	#define	C1MSL12EID2		(*(uchar *)0x008015C4)
	#define	C1MSL12DLC		(*(uchar *)0x008015C5)
	#define	C1MSL12DT0		(*(uchar *)0x008015C6)
	#define	C1MSL12DT1		(*(uchar *)0x008015C7)
	#define	C1MSL12DT2		(*(uchar *)0x008015C8)
	#define	C1MSL12DT3		(*(uchar *)0x008015C9)
	#define	C1MSL12DT4		(*(uchar *)0x008015CA)
	#define	C1MSL12DT5		(*(uchar *)0x008015CB)
	#define	C1MSL12DT6		(*(uchar *)0x008015CC)
	#define	C1MSL12DT7		(*(uchar *)0x008015CD)
	#define	C1MSL12TSP		(*(ushort *)0x008015CE)

