Ihara-Hideki/BZ5_RX66T/workspace/BZ5/src/common/compile/H/SfrRegister.h
	#define	C1MSL13SID0		(*(uchar *)0x008015D0)
	#define	C1MSL13SID1		(*(uchar *)0x008015D1)
	#define	C1MSL13EID0		(*(uchar *)0x008015D2)
	#define	C1MSL13EID1		(*(uchar *)0x008015D3)
	#define	C1MSL13EID2		(*(uchar *)0x008015D4)
	#define	C1MSL13DLC		(*(uchar *)0x008015D5)
	#define	C1MSL13DT0		(*(uchar *)0x008015D6)
	#define	C1MSL13DT1		(*(uchar *)0x008015D7)
	#define	C1MSL13DT2		(*(uchar *)0x008015D8)
	#define	C1MSL13DT3		(*(uchar *)0x008015D9)
	#define	C1MSL13DT4		(*(uchar *)0x008015DA)
	#define	C1MSL13DT5		(*(uchar *)0x008015DB)
	#define	C1MSL13DT6		(*(uchar *)0x008015DC)
	#define	C1MSL13DT7		(*(uchar *)0x008015DD)
	#define	C1MSL13TSP		(*(ushort *)0x008015DE)

	#define	C1MSL14SID0		(*(uchar *)0x008015E0)
	#define	C1MSL14SID1		(*(uchar *)0x008015E1)
	#define	C1MSL14EID0		(*(uchar *)0x008015E2)
	#define	C1MSL14EID1		(*(uchar *)0x008015E3)
	#define	C1MSL14EID2		(*(uchar *)0x008015E4)
	#define	C1MSL14DLC		(*(uchar *)0x008015E5)
	#define	C1MSL14DT0		(*(uchar *)0x008015E6)
	#define	C1MSL14DT1		(*(uchar *)0x008015E7)
	#define	C1MSL14DT2		(*(uchar *)0x008015E8)
	#define	C1MSL14DT3		(*(uchar *)0x008015E9)
	#define	C1MSL14DT4		(*(uchar *)0x008015EA)
	#define	C1MSL14DT5		(*(uchar *)0x008015EB)
	#define	C1MSL14DT6		(*(uchar *)0x008015EC)
	#define	C1MSL14DT7		(*(uchar *)0x008015ED)
	#define	C1MSL14TSP		(*(ushort *)0x008015EE)

	#define	C1MSL15SID0		(*(uchar *)0x008015F0)
	#define	C1MSL15SID1		(*(uchar *)0x008015F1)
	#define	C1MSL15EID0		(*(uchar *)0x008015F2)
	#define	C1MSL15EID1		(*(uchar *)0x008015F3)
	#define	C1MSL15EID2		(*(uchar *)0x008015F4)
	#define	C1MSL15DLC		(*(uchar *)0x008015F5)
	#define	C1MSL15DT0		(*(uchar *)0x008015F6)
	#define	C1MSL15DT1		(*(uchar *)0x008015F7)
	#define	C1MSL15DT2		(*(uchar *)0x008015F8)
	#define	C1MSL15DT3		(*(uchar *)0x008015F9)
	#define	C1MSL15DT4		(*(uchar *)0x008015FA)
	#define	C1MSL15DT5		(*(uchar *)0x008015FB)
	#define	C1MSL15DT6		(*(uchar *)0x008015FC)
	#define	C1MSL15DT7		(*(uchar *)0x008015FD)
	#define	C1MSL15TSP		(*(ushort *)0x008015FE)

	#define	C1MSL16SID0		(*(uchar *)0x00801600)
	#define	C1MSL16SID1		(*(uchar *)0x00801601)
	#define	C1MSL16EID0		(*(uchar *)0x00801602)
	#define	C1MSL16EID1		(*(uchar *)0x00801603)
	#define	C1MSL16EID2		(*(uchar *)0x00801604)
	#define	C1MSL16DLC		(*(uchar *)0x00801605)
	#define	C1MSL16DT0		(*(uchar *)0x00801606)
	#define	C1MSL16DT1		(*(uchar *)0x00801607)
	#define	C1MSL16DT2		(*(uchar *)0x00801608)
	#define	C1MSL16DT3		(*(uchar *)0x00801609)
	#define	C1MSL16DT4		(*(uchar *)0x0080160A)
	#define	C1MSL16DT5		(*(uchar *)0x0080160B)
	#define	C1MSL16DT6		(*(uchar *)0x0080160C)
	#define	C1MSL16DT7		(*(uchar *)0x0080160D)
	#define	C1MSL16TSP		(*(ushort *)0x0080160E)

	#define	C1MSL17SID0		(*(uchar *)0x00801610)
	#define	C1MSL17SID1		(*(uchar *)0x00801611)
	#define	C1MSL17EID0		(*(uchar *)0x00801612)
	#define	C1MSL17EID1		(*(uchar *)0x00801613)
	#define	C1MSL17EID2		(*(uchar *)0x00801614)
	#define	C1MSL17DLC		(*(uchar *)0x00801615)
	#define	C1MSL17DT0		(*(uchar *)0x00801616)
	#define	C1MSL17DT1		(*(uchar *)0x00801617)
	#define	C1MSL17DT2		(*(uchar *)0x00801618)
	#define	C1MSL17DT3		(*(uchar *)0x00801619)
	#define	C1MSL17DT4		(*(uchar *)0x0080161A)
	#define	C1MSL17DT5		(*(uchar *)0x0080161B)
	#define	C1MSL17DT6		(*(uchar *)0x0080161C)
	#define	C1MSL17DT7		(*(uchar *)0x0080161D)
	#define	C1MSL17TSP		(*(ushort *)0x0080161E)

	#define	C1MSL18SID0		(*(uchar *)0x00801620)
	#define	C1MSL18SID1		(*(uchar *)0x00801621)
	#define	C1MSL18EID0		(*(uchar *)0x00801622)
	#define	C1MSL18EID1		(*(uchar *)0x00801623)
	#define	C1MSL18EID2		(*(uchar *)0x00801624)
	#define	C1MSL18DLC		(*(uchar *)0x00801625)
	#define	C1MSL18DT0		(*(uchar *)0x00801626)
	#define	C1MSL18DT1		(*(uchar *)0x00801627)
	#define	C1MSL18DT2		(*(uchar *)0x00801628)
	#define	C1MSL18DT3		(*(uchar *)0x00801629)
	#define	C1MSL18DT4		(*(uchar *)0x0080162A)
	#define	C1MSL18DT5		(*(uchar *)0x0080162B)
	#define	C1MSL18DT6		(*(uchar *)0x0080162C)
	#define	C1MSL18DT7		(*(uchar *)0x0080162D)
	#define	C1MSL18TSP		(*(ushort *)0x0080162E)

	#define	C1MSL19SID0		(*(uchar *)0x00801630)
	#define	C1MSL19SID1		(*(uchar *)0x00801631)
	#define	C1MSL19EID0		(*(uchar *)0x00801632)
	#define	C1MSL19EID1		(*(uchar *)0x00801633)
	#define	C1MSL19EID2		(*(uchar *)0x00801634)
	#define	C1MSL19DLC		(*(uchar *)0x00801635)
	#define	C1MSL19DT0		(*(uchar *)0x00801636)
	#define	C1MSL19DT1		(*(uchar *)0x00801637)
	#define	C1MSL19DT2		(*(uchar *)0x00801638)
	#define	C1MSL19DT3		(*(uchar *)0x00801639)
	#define	C1MSL19DT4		(*(uchar *)0x0080163A)
	#define	C1MSL19DT5		(*(uchar *)0x0080163B)
	#define	C1MSL19DT6		(*(uchar *)0x0080163C)
	#define	C1MSL19DT7		(*(uchar *)0x0080163D)
	#define	C1MSL19TSP		(*(ushort *)0x0080163E)

	#define	C1MSL20SID0		(*(uchar *)0x00801640)
	#define	C1MSL20SID1		(*(uchar *)0x00801641)
	#define	C1MSL20EID0		(*(uchar *)0x00801642)
	#define	C1MSL20EID1		(*(uchar *)0x00801643)
	#define	C1MSL20EID2		(*(uchar *)0x00801644)
	#define	C1MSL20DLC		(*(uchar *)0x00801645)
	#define	C1MSL20DT0		(*(uchar *)0x00801646)
	#define	C1MSL20DT1		(*(uchar *)0x00801647)
	#define	C1MSL20DT2		(*(uchar *)0x00801648)
	#define	C1MSL20DT3		(*(uchar *)0x00801649)
	#define	C1MSL20DT4		(*(uchar *)0x0080164A)
	#define	C1MSL20DT5		(*(uchar *)0x0080164B)
	#define	C1MSL20DT6		(*(uchar *)0x0080164C)
	#define	C1MSL20DT7		(*(uchar *)0x0080164D)
	#define	C1MSL20TSP		(*(ushort *)0x0080164E)

	#define	C1MSL21SID0		(*(uchar *)0x00801650)
	#define	C1MSL21SID1		(*(uchar *)0x00801651)
	#define	C1MSL21EID0		(*(uchar *)0x00801652)
	#define	C1MSL21EID1		(*(uchar *)0x00801653)
	#define	C1MSL21EID2		(*(uchar *)0x00801654)
	#define	C1MSL21DLC		(*(uchar *)0x00801655)
	#define	C1MSL21DT0		(*(uchar *)0x00801656)
	#define	C1MSL21DT1		(*(uchar *)0x00801657)
	#define	C1MSL21DT2		(*(uchar *)0x00801658)
	#define	C1MSL21DT3		(*(uchar *)0x00801659)
	#define	C1MSL21DT4		(*(uchar *)0x0080165A)
	#define	C1MSL21DT5		(*(uchar *)0x0080165B)
	#define	C1MSL21DT6		(*(uchar *)0x0080165C)
	#define	C1MSL21DT7		(*(uchar *)0x0080165D)
	#define	C1MSL21TSP		(*(ushort *)0x0080165E)

