Ihara-Hideki/BZ5_RX66T/workspace/BZ5/src/common/compile/H/SfrRegister.h
	#define	C1MSL22SID0		(*(uchar *)0x00801660)
	#define	C1MSL22SID1		(*(uchar *)0x00801661)
	#define	C1MSL22EID0		(*(uchar *)0x00801662)
	#define	C1MSL22EID1		(*(uchar *)0x00801663)
	#define	C1MSL22EID2		(*(uchar *)0x00801664)
	#define	C1MSL22DLC		(*(uchar *)0x00801665)
	#define	C1MSL22DT0		(*(uchar *)0x00801666)
	#define	C1MSL22DT1		(*(uchar *)0x00801667)
	#define	C1MSL22DT2		(*(uchar *)0x00801668)
	#define	C1MSL22DT3		(*(uchar *)0x00801669)
	#define	C1MSL22DT4		(*(uchar *)0x0080166A)
	#define	C1MSL22DT5		(*(uchar *)0x0080166B)
	#define	C1MSL22DT6		(*(uchar *)0x0080166C)
	#define	C1MSL22DT7		(*(uchar *)0x0080166D)
	#define	C1MSL22TSP		(*(ushort *)0x0080166E)

	#define	C1MSL23SID0		(*(uchar *)0x00801670)
	#define	C1MSL23SID1		(*(uchar *)0x00801671)
	#define	C1MSL23EID0		(*(uchar *)0x00801672)
	#define	C1MSL23EID1		(*(uchar *)0x00801673)
	#define	C1MSL23EID2		(*(uchar *)0x00801674)
	#define	C1MSL23DLC		(*(uchar *)0x00801675)
	#define	C1MSL23DT0		(*(uchar *)0x00801676)
	#define	C1MSL23DT1		(*(uchar *)0x00801677)
	#define	C1MSL23DT2		(*(uchar *)0x00801678)
	#define	C1MSL23DT3		(*(uchar *)0x00801679)
	#define	C1MSL23DT4		(*(uchar *)0x0080167A)
	#define	C1MSL23DT5		(*(uchar *)0x0080167B)
	#define	C1MSL23DT6		(*(uchar *)0x0080167C)
	#define	C1MSL23DT7		(*(uchar *)0x0080167D)
	#define	C1MSL23TSP		(*(ushort *)0x0080167E)

	#define	C1MSL24SID0		(*(uchar *)0x00801680)
	#define	C1MSL24SID1		(*(uchar *)0x00801681)
	#define	C1MSL24EID0		(*(uchar *)0x00801682)
	#define	C1MSL24EID1		(*(uchar *)0x00801683)
	#define	C1MSL24EID2		(*(uchar *)0x00801684)
	#define	C1MSL24DLC		(*(uchar *)0x00801685)
	#define	C1MSL24DT0		(*(uchar *)0x00801686)
	#define	C1MSL24DT1		(*(uchar *)0x00801687)
	#define	C1MSL24DT2		(*(uchar *)0x00801688)
	#define	C1MSL24DT3		(*(uchar *)0x00801689)
	#define	C1MSL24DT4		(*(uchar *)0x0080168A)
	#define	C1MSL24DT5		(*(uchar *)0x0080168B)
	#define	C1MSL24DT6		(*(uchar *)0x0080168C)
	#define	C1MSL24DT7		(*(uchar *)0x0080168D)
	#define	C1MSL24TSP		(*(ushort *)0x0080168E)

	#define	C1MSL25SID0		(*(uchar *)0x00801690)
	#define	C1MSL25SID1		(*(uchar *)0x00801691)
	#define	C1MSL25EID0		(*(uchar *)0x00801692)
	#define	C1MSL25EID1		(*(uchar *)0x00801693)
	#define	C1MSL25EID2		(*(uchar *)0x00801694)
	#define	C1MSL25DLC		(*(uchar *)0x00801695)
	#define	C1MSL25DT0		(*(uchar *)0x00801696)
	#define	C1MSL25DT1		(*(uchar *)0x00801697)
	#define	C1MSL25DT2		(*(uchar *)0x00801698)
	#define	C1MSL25DT3		(*(uchar *)0x00801699)
	#define	C1MSL25DT4		(*(uchar *)0x0080169A)
	#define	C1MSL25DT5		(*(uchar *)0x0080169B)
	#define	C1MSL25DT6		(*(uchar *)0x0080169C)
	#define	C1MSL25DT7		(*(uchar *)0x0080169D)
	#define	C1MSL25TSP		(*(ushort *)0x0080169E)

	#define	C1MSL26SID0		(*(uchar *)0x008016A0)
	#define	C1MSL26SID1		(*(uchar *)0x008016A1)
	#define	C1MSL26EID0		(*(uchar *)0x008016A2)
	#define	C1MSL26EID1		(*(uchar *)0x008016A3)
	#define	C1MSL26EID2		(*(uchar *)0x008016A4)
	#define	C1MSL26DLC		(*(uchar *)0x008016A5)
	#define	C1MSL26DT0		(*(uchar *)0x008016A6)
	#define	C1MSL26DT1		(*(uchar *)0x008016A7)
	#define	C1MSL26DT2		(*(uchar *)0x008016A8)
	#define	C1MSL26DT3		(*(uchar *)0x008016A9)
	#define	C1MSL26DT4		(*(uchar *)0x008016AA)
	#define	C1MSL26DT5		(*(uchar *)0x008016AB)
	#define	C1MSL26DT6		(*(uchar *)0x008016AC)
	#define	C1MSL26DT7		(*(uchar *)0x008016AD)
	#define	C1MSL26TSP		(*(ushort *)0x008016AE)

	#define	C1MSL27SID0		(*(uchar *)0x008016B0)
	#define	C1MSL27SID1		(*(uchar *)0x008016B1)
	#define	C1MSL27EID0		(*(uchar *)0x008016B2)
	#define	C1MSL27EID1		(*(uchar *)0x008016B3)
	#define	C1MSL27EID2		(*(uchar *)0x008016B4)
	#define	C1MSL27DLC		(*(uchar *)0x008016B5)
	#define	C1MSL27DT0		(*(uchar *)0x008016B6)
	#define	C1MSL27DT1		(*(uchar *)0x008016B7)
	#define	C1MSL27DT2		(*(uchar *)0x008016B8)
	#define	C1MSL27DT3		(*(uchar *)0x008016B9)
	#define	C1MSL27DT4		(*(uchar *)0x008016BA)
	#define	C1MSL27DT5		(*(uchar *)0x008016BB)
	#define	C1MSL27DT6		(*(uchar *)0x008016BC)
	#define	C1MSL27DT7		(*(uchar *)0x008016BD)
	#define	C1MSL27TSP		(*(ushort *)0x008016BE)

	#define	C1MSL28SID0		(*(uchar *)0x008016C0)
	#define	C1MSL28SID1		(*(uchar *)0x008016C1)
	#define	C1MSL28EID0		(*(uchar *)0x008016C2)
	#define	C1MSL28EID1		(*(uchar *)0x008016C3)
	#define	C1MSL28EID2		(*(uchar *)0x008016C4)
	#define	C1MSL28DLC		(*(uchar *)0x008016C5)
	#define	C1MSL28DT0		(*(uchar *)0x008016C6)
	#define	C1MSL28DT1		(*(uchar *)0x008016C7)
	#define	C1MSL28DT2		(*(uchar *)0x008016C8)
	#define	C1MSL28DT3		(*(uchar *)0x008016C9)
	#define	C1MSL28DT4		(*(uchar *)0x008016CA)
	#define	C1MSL28DT5		(*(uchar *)0x008016CB)
	#define	C1MSL28DT6		(*(uchar *)0x008016CC)
	#define	C1MSL28DT7		(*(uchar *)0x008016CD)
	#define	C1MSL28TSP		(*(ushort *)0x008016CE)

	#define	C1MSL29SID0		(*(uchar *)0x008016D0)
	#define	C1MSL29SID1		(*(uchar *)0x008016D1)
	#define	C1MSL29EID0		(*(uchar *)0x008016D2)
	#define	C1MSL29EID1		(*(uchar *)0x008016D3)
	#define	C1MSL29EID2		(*(uchar *)0x008016D4)
	#define	C1MSL29DLC		(*(uchar *)0x008016D5)
	#define	C1MSL29DT0		(*(uchar *)0x008016D6)
	#define	C1MSL29DT1		(*(uchar *)0x008016D7)
	#define	C1MSL29DT2		(*(uchar *)0x008016D8)
	#define	C1MSL29DT3		(*(uchar *)0x008016D9)
	#define	C1MSL29DT4		(*(uchar *)0x008016DA)
	#define	C1MSL29DT5		(*(uchar *)0x008016DB)
	#define	C1MSL29DT6		(*(uchar *)0x008016DC)
	#define	C1MSL29DT7		(*(uchar *)0x008016DD)
	#define	C1MSL29TSP		(*(ushort *)0x008016DE)

	#define	C1MSL30SID0		(*(uchar *)0x008016E0)
	#define	C1MSL30SID1		(*(uchar *)0x008016E1)
	#define	C1MSL30EID0		(*(uchar *)0x008016E2)
	#define	C1MSL30EID1		(*(uchar *)0x008016E3)
	#define	C1MSL30EID2		(*(uchar *)0x008016E4)
	#define	C1MSL30DLC		(*(uchar *)0x008016E5)
	#define	C1MSL30DT0		(*(uchar *)0x008016E6)
	#define	C1MSL30DT1		(*(uchar *)0x008016E7)
	#define	C1MSL30DT2		(*(uchar *)0x008016E8)
	#define	C1MSL30DT3		(*(uchar *)0x008016E9)
	#define	C1MSL30DT4		(*(uchar *)0x008016EA)
	#define	C1MSL30DT5		(*(uchar *)0x008016EB)
	#define	C1MSL30DT6		(*(uchar *)0x008016EC)
	#define	C1MSL30DT7		(*(uchar *)0x008016ED)
	#define	C1MSL30TSP		(*(ushort *)0x008016EE)

