Ihara-Hideki/BZ5_RX66T/workspace/BZ5/src/common/compile/H/SfrRegister.h
	#define	C1MSL31SID0		(*(uchar *)0x008016F0)
	#define	C1MSL31SID1		(*(uchar *)0x008016F1)
	#define	C1MSL31EID0		(*(uchar *)0x008016F2)
	#define	C1MSL31EID1		(*(uchar *)0x008016F3)
	#define	C1MSL31EID2		(*(uchar *)0x008016F4)
	#define	C1MSL31DLC		(*(uchar *)0x008016F5)
	#define	C1MSL31DT0		(*(uchar *)0x008016F6)
	#define	C1MSL31DT1		(*(uchar *)0x008016F7)
	#define	C1MSL31DT2		(*(uchar *)0x008016F8)
	#define	C1MSL31DT3		(*(uchar *)0x008016F9)
	#define	C1MSL31DT4		(*(uchar *)0x008016FA)
	#define	C1MSL31DT5		(*(uchar *)0x008016FB)
	#define	C1MSL31DT6		(*(uchar *)0x008016FC)
	#define	C1MSL31DT7		(*(uchar *)0x008016FD)
	#define	C1MSL31TSP		(*(ushort *)0x008016FE)

	#define	DRIDINIST		(*(uchar *)0x00802000)
	#define	DRIDINIEN		(*(uchar *)0x00802001)
	#define	DRIDECIST		(*(uchar *)0x00802002)
	#define	DRIDECIEN		(*(uchar *)0x00802003)
	#define	DRITRMIST		(*(uchar *)0x00802004)
	#define	DRITRMIEN		(*(uchar *)0x00802005)
	#define	DRITRMCNT		(*(uchar *)0x00802006)
	#define	DRISPMOD		(*(uchar *)0x00802007)
	#define	DRICAPCNT		(*(ushort *)0x00802008)
	#define	DRIDSELCNT		(*(uchar *)0x0080200A)
	#define	DINSEL			(*(uchar *)0x0080200B)
	#define	DRIDDEN0		(*(uchar *)0x0080200C)
	#define	DRIDDEN1		(*(uchar *)0x0080200D)
	#define	DRIDDEN2		(*(uchar *)0x0080200E)
	#define	DRIDDEN3		(*(uchar *)0x0080200F)

	#define	DRIDCAPNUM		(*(ulong *)0x00802010)
	#define	DRIDCAPCT		(*(ulong *)0x00802014)
	#define	DRITMRCT		(*(ulong *)0x00802018)

	#define	DRIADR0RLD		(*(ulong *)0x00802020)
	#define	DRIADR0CT		(*(ulong *)0x00802024)
	#define	DRIADR1RLD		(*(ulong *)0x00802028)
	#define	DRIADR1CT		(*(ulong *)0x0080202C)

	#define	DINCNT			(*(ushort *)0x00802030)

	#define	DEC0CNT			(*(uchar *)0x00802032)
	#define	DEC0RLD			(*(ushort *)0x00802034)
	#define	DEC0CT			(*(ushort *)0x00802036)

	#define	DEC1CNT			(*(uchar *)0x00802038)
	#define	DEC1RLD			(*(ushort *)0x0080203A)
	#define	DEC1CT			(*(ushort *)0x0080203C)

	#define	DEC2CNT			(*(uchar *)0x0080203E)
	#define	DEC2RLD			(*(ushort *)0x00802040)
	#define	DEC2CT  		(*(ushort *)0x00802042)

	#define	DEC3CNT			(*(uchar *)0x00802044)
	#define	DEC3RLD			(*(ushort *)0x00802046)
	#define	DEC3CT  		(*(ushort *)0x00802048)

	#define	DEC4CNT			(*(uchar *)0x0080204A)
	#define	DEC4RLD			(*(ushort *)0x0080204C)
	#define	DEC4CT  		(*(ushort *)0x0080204E)

// NBDêßå‰óÃàÊ
	#define	NBDENB  		(*(uchar *)0xE0000000)
	#define	NBDCNT  		(*(uchar *)0xE0000004)
	#define	NEVNTGEN		(*(uchar *)0xE0000008)
#endif	// __M32186

#endif
//<><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><>
//  End of SfrRegister.h
//<><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><><>
